[
{"name": "Taj Mahal", "note": "4.0 of 5 bubbles", "reviews": [{"text": "The price is not what you eat , simple they steal , 1 rice is 1500da equal 6euro and that is not normal at all because bassmati rice for 1 kg by the market the max is 450 da equal 1.99 euros ,  hopefully the...", "stars": "ui_bubble_rating bubble_10", "date": "August 11, 2023"}, {"text": "Very good staff very friendly while the food is acceptable.. it is not very spicy as expected. But overall it was not a bad experience.", "stars": "ui_bubble_rating bubble_40", "date": "December 29, 2022"}, {"text": "Nothing exceptionnel , the restaurant was too dark, and the food too cold, the waiter didnt bring us our food in time, we had to wait an hour or more for him to place us at a table", "stars": "ui_bubble_rating bubble_20", "date": "October 11, 2022"}, {"text": "With a good manager has a good dealing  and the food is delicious , i have to say thanks to all staff & i will come again, 🇩🇿🇮🇳", "stars": "ui_bubble_rating bubble_50", "date": "October 3, 2022"}, {"text": "the servie is very good  -the food is very good -wallah is very cute -im whit my baby boy just want go to the restaurant all the time", "stars": "ui_bubble_rating bubble_50", "date": "April 7, 2022"}, {"text": "Great food as usual ! We had a Mixed plata chicken kebbab,  gira rice ( du riz au cumin) ummmm a delight! Garlic bread and cheese bread. Waiters very helpful and the manager  very smiling and welcoming. We had a wonderful time. I just love...", "stars": "ui_bubble_rating bubble_50", "date": "April 12, 2021"}, {"text": "It's my best restaurant ever, I am living in algeria and I prefer Taj Mahal because we can eat very good indian food. Tasty and original. It's the best", "stars": "ui_bubble_rating bubble_50", "date": "October 5, 2020"}, {"text": "Food is very tasty, typical Indian food, clean restaurant. And different meals on menu. You can enjoy with friends, family and also children.Taj Mahal is the best Indian restaurant in Algeria .", "stars": "ui_bubble_rating bubble_50", "date": "November 19, 2019"}, {"text": "Excellent food very good decoration..Excellent service... authentic Indian food .very tasty and service is very professional.its my 5th time and I am always surprised by the quality.", "stars": "ui_bubble_rating bubble_50", "date": "November 14, 2019"}, {"text": "Portions are large and delicious. One of the best meals in Algeria. They helped me with an Uber back to my hotel.", "stars": "ui_bubble_rating bubble_50", "date": "October 19, 2019"}, {"text": "Again it was the time to have an Indian dinner\nNice atmosphere and delicious food\nFriendly service \nBut in my experience the taste was ordinary not an special one as I have already ate same dishes in different restaurant in different countries", "stars": "ui_bubble_rating bubble_40", "date": "September 4, 2019"}, {"text": "Great Indian food in Algiers.  Lots of meat options as well as vegetarian.  Biryanis rice bowls and many different types of naan.  On the expensive side, but the portions are very large.  Able to seat you without a reservation.  Very friendly staff.", "stars": "ui_bubble_rating bubble_50", "date": "August 28, 2019"}, {"text": "Had dinner here on a business trip, great atmosphere and outstanding food, the menu choices are extensive and the dishes are both filling and delicious. It’s a must try in Algiers, you will not be disappointed.", "stars": "ui_bubble_rating bubble_50", "date": "August 14, 2019"}, {"text": "This is a real Indian food restaurant in Algiers; you will actually see Indian cooks busy preparing dishes with the delicious vegetables and all ingredients found in Algeria. I recommend !", "stars": "ui_bubble_rating bubble_50", "date": "June 4, 2019"}, {"text": "A good place to have a good indian food.. No complaints exceo some odd days they have bad chicken with them which is like a old one...\n\nIf not they r really good....", "stars": "ui_bubble_rating bubble_50", "date": "April 13, 2019"}]},
{"name": "Le Béarnais", "note": "4.0 of 5 bubbles", "reviews": [{"text": "English version below\n\nNe pas hésité à aller dans ce restaurant en centre ville d'Alger, excellente cuisine française, dommage que le restaurant ne soit pas fumeur.\nDo not hesitate to visit this restaurant in down town Algier, old french receipies are very good, a shame,...", "stars": "ui_bubble_rating bubble_40", "date": "August 2, 2018"}, {"text": "Difficult to find in downtown. Only for \"connoisseurs\". But you will be rewarded. Good food, good Algerian wine, good friendly service, reasonable bill. Definitely a place to go", "stars": "ui_bubble_rating bubble_40", "date": "April 15, 2018"}, {"text": "I had a lovely evening here. I arrived late, around 21:30 and had been worried the kitchen might have closed. The waiter could not have been happier to greet me. The place was about two thirds full, I chose a table on the lower ground...", "stars": "ui_bubble_rating bubble_50", "date": "February 19, 2018"}, {"text": "This is probably like of the finest restaurants in town. A wide full option of meat and fish dishes coming from the more international to the more traditional meals.\nFriendly and efficient staff and a cosy atmosphere makes the rest.", "stars": "ui_bubble_rating bubble_40", "date": "May 5, 2017"}, {"text": "Me and my bro visited it after searching online where to have a beer.\n\nThe pictures on here don't do it justice and it's much nicer in person. We didn't eat but drank there local beer, Albrau for 350 dinars. \n\nNo English spoken but we...", "stars": "ui_bubble_rating bubble_40", "date": "April 29, 2017"}, {"text": "been twice. First time very good, all reliable. Second time, prawns were too greasy and the meat was not as good. So would still go again but would like it to rebound", "stars": "ui_bubble_rating bubble_30", "date": "December 8, 2016"}, {"text": "The food is ok, only I was disappointed to see how alcohol is freely served to Anybody, as we were not in a good muslim country.\n l suggest to at least reserve an alcohol free zone for whom does not like to dine With drunk...", "stars": "ui_bubble_rating bubble_20", "date": "April 27, 2016"}, {"text": "Just moments away from where we were staying, the ST Hotel, is Le Bearnais. We found it using Google maps and the only sign that it was open was a lit neon sign bearing the name. There was a closed door and blacked out windows....", "stars": "ui_bubble_rating bubble_40", "date": "April 8, 2016"}, {"text": "Easy to find\nYou ring a doorbell to get in\nThe waiters have very little English so brush up on basic French \nI had schrimp starter and steak plus crime de brûlée \nBeers available \nSmall Algerian ones at 200 dinar\nPretty weak\nExpensive enough but...", "stars": "ui_bubble_rating bubble_40", "date": "April 1, 2016"}, {"text": "An excellent place with good service! Foods are delicious and a rare place which is serving alcohol. Its not so easy to find it, location is ok but you can not even imagine that the door would be opening to this place. Door was closed...", "stars": "ui_bubble_rating bubble_50", "date": "January 27, 2016"}, {"text": "Le Bearnais is a trademark restaurant of the city center located in a  popular street. Doesn't look much from the outside but once the door opens, you are in a very cozy French type restaurant on a split-level. Held by the same family since 30...", "stars": "ui_bubble_rating bubble_50", "date": "January 13, 2016"}, {"text": "Had a business dinner, good restaurant, excellent service, offer good fish, which seems to be hard to find in Alger. Offer beer and local wine and a fantastic chocolate coulant. My only criticism is that they allow smoking anywhere and for those who dont want...", "stars": "ui_bubble_rating bubble_40", "date": "February 17, 2013"}, {"text": "The Béarnais (as it should be spelt!) is situated right in the town centre just off the main drag. The cuisine is clearly French at heart, but with many Algerian touches  - or maybe it is Algerian with French touches! For instance, I have never...", "stars": "ui_bubble_rating bubble_40", "date": "June 12, 2012"}, {"text": "Classy restaurant with excellent French cuisine. Cozy atmosphere and higher but appropriate prices", "stars": "ui_bubble_rating bubble_50", "date": "April 5, 2012"}]},
{"name": "Saladbox", "note": "4.5 of 5 bubbles", "reviews": [{"text": "For the ppl whom like to eat vegetarian food this is the Place a various types of Salades 🌿☘🍀🍀🍃 you can enjoy in this restaurant which is located in the commercial center of Ardis 😍😍😍🤗🤗🌺🌺\nThey have Alsoo Awonderfull and breath taking Delicious Soup 🍲🍲🍲🍜🍜...", "stars": "ui_bubble_rating bubble_50", "date": "April 23, 2018"}, {"text": "This is one of those places you should avoid in the weekend. Crowed shopping mall with crying children all over makes a space to avoid during Friday and Saturday. The salades thought are nice and it's nice to see that the light fast food is...", "stars": "ui_bubble_rating bubble_20", "date": "April 16, 2018"}, {"text": "i hqve been with my friend to algeria and he made me to test salad box .... i was surprised... i guess its the best restaurent in all the city", "stars": "ui_bubble_rating bubble_50", "date": "February 5, 2018"}, {"text": "so good food, so fresh ingredients , so nice , people , so clean place, so friendly boss, so amazing experience", "stars": "ui_bubble_rating bubble_50", "date": "February 1, 2018"}, {"text": "I wss adviced by a friend and really I was surprised by the level  ! \nIt was a great experience that I will always remember.", "stars": "ui_bubble_rating bubble_50", "date": "February 1, 2018"}, {"text": "the best healthy restaurent in all algeria as know, i had an exellent mill , congratuations, i recommend to evry one", "stars": "ui_bubble_rating bubble_50", "date": "December 2, 2017"}, {"text": "Addicted to the sport and the healthy product, the places attracted me, I assayed them once since I added them on the stuff addicted to them lol, fresh food good service what more! A big thank you to abdellah boudria of permettre to our society...", "stars": "ui_bubble_rating bubble_50", "date": "December 14, 2016"}, {"text": "the ingredients are so fresh that even when you have a mixed salad you can feel the taste each of them (y) . Happy for discovering it :)", "stars": "ui_bubble_rating bubble_50", "date": "December 12, 2016"}, {"text": "I really enjoyed my salad there ! It was so delicious and tasty ! I didn't believe such a good place exists in Algeria! I tried it many times and will absolutely try it again.", "stars": "ui_bubble_rating bubble_50", "date": "December 12, 2016"}, {"text": "it was a very yummy meal , i liked it too much . my friends did like it too . it is healthy tasty and so safe food .i just wish i can eat there one more time", "stars": "ui_bubble_rating bubble_50", "date": "December 12, 2016"}, {"text": "good services fresh vegetables and its very cleany you can have all the taste tou want and can avoid stuff you dislike", "stars": "ui_bubble_rating bubble_50", "date": "December 10, 2016"}]},
{"name": "Restaurant Le Tyrolien", "note": "4.0 of 5 bubbles", "reviews": [{"text": "This is definitely one of the beast meat restaurants in town for the moment. Eating at the compter is a rare thing these days but still possible at Le Tyrolien. The meat is grilled in front of you and the quality is noticeable. Besides the...", "stars": "ui_bubble_rating bubble_40", "date": "March 4, 2023"}, {"text": "This restaurant is hidden in a small street near \"La Grand Poste\", and can be easily reached by metro. I've ordered the entrecote, and it was cooked exactly the way i've asked for... as mentioned, you'll sit on the counter facing the grill whilst the...", "stars": "ui_bubble_rating bubble_40", "date": "November 20, 2018"}, {"text": "I did not found anything special with this restaurant, they have just a normal food like any other Algerian restaurant.", "stars": "ui_bubble_rating bubble_30", "date": "May 18, 2018"}, {"text": "The restaurant is located on a small street busy with the local residents. It is highly recommend to make reservation prior to your visit. \nThey serve delicious bbq food with other local tastes.\nI suggest to all meat lovers.", "stars": "ui_bubble_rating bubble_40", "date": "February 14, 2018"}, {"text": "This chic restaurant, in business since the 1970s, is very popular and reservations are recommended. We were warmly greeted by a friendly host, possibly the owner, and promptly led to our upstairs table by a very pleasant waiter. The menu was elegant, featuring various types...", "stars": "ui_bubble_rating bubble_50", "date": "October 3, 2017"}, {"text": "A very nice place where you could have a decent quite dinner within a very decent crowd...\nParking us not easy in the area ...so be prepared...\nPrices are reasonable ..", "stars": "ui_bubble_rating bubble_30", "date": "May 17, 2017"}, {"text": "In city center, in a small street difficult to reach.\nOn three levels. The kitchen is an open space and a places are all around, you can watch the chef cooking.\nService is professional and gentle.\nPrices unexpectedly high, especially the salads can be a...", "stars": "ui_bubble_rating bubble_40", "date": "February 7, 2017"}, {"text": "Very nice restaurant, meat is great, wonderful avocado salad, I ate fillet, chicken, and mergaz (local hotdog I guess) I was surprised to know they opened a new branch in Hydra, Marwa buildings. Strongly recommend.", "stars": "ui_bubble_rating bubble_50", "date": "November 19, 2016"}, {"text": "Good place, nice restaurant, with nice and fresh meat, very clean place, where the service is very good.", "stars": "ui_bubble_rating bubble_40", "date": "November 9, 2016"}, {"text": "Cozy place with nice meat and wine\nFriendly staff but not invasion \nThe only think should be rearrange i think is the entrance and the the stairs", "stars": "ui_bubble_rating bubble_30", "date": "September 9, 2016"}, {"text": "Very good meat dishes.\nWe have eaten beef merguez, lamb and beef.\nThe taste is perfect.\nMost clean restaurant visited in Algiers.\nGo there !", "stars": "ui_bubble_rating bubble_50", "date": "August 4, 2016"}, {"text": "As of April 2016 they have stopped serving alcohol, but they do now have a new sign outside. When asked about the alcohol, the owner said \"now halal\".", "stars": "ui_bubble_rating bubble_20", "date": "April 23, 2016"}, {"text": "I was taken to this restaurant by some local Algerian's.\nIt was brilliant, lots of meat cooked to perfection.  I had a steak rare, which was exquisite.  The chef was very helpful and wanted to ensure that I was well looked after.\nYou wont ever...", "stars": "ui_bubble_rating bubble_50", "date": "March 14, 2016"}, {"text": "Restaurant Le Tyrolien located in the heart of the Algerian capital.\nA steakhouse/BBQ concept the decor rustic, brick walls and a lot wood are intended to be easy going, friendly and no formal approach. \nThe restaurant spill out in to ground level for Bar pre...", "stars": "ui_bubble_rating bubble_50", "date": "December 24, 2015"}, {"text": "Visited back in 2007 invited by a friend , I found this restaurant to lack of atmosphere and the food was too expensive for nothing special...also the Hygiene was so so!! I don't know if I would recommend it", "stars": "ui_bubble_rating bubble_20", "date": "December 9, 2015"}]},
{"name": "Signature", "note": "4.0 of 5 bubbles", "reviews": [{"text": "A fabulous brunchbox, and  excellent service 😍\nThis morning I found a Quality food with truly sympathique mixture in juste one lovely box.", "stars": "ui_bubble_rating bubble_50", "date": "March 13, 2021"}, {"text": "Delicious brunch delivered Friday morning to your house! We had pancakes  avocado toasts, porridge and granola bowl. Everything was delicious, greatly presented in a the \"Brunch box\". We recommend Signature and their tasty brunch box!", "stars": "ui_bubble_rating bubble_50", "date": "January 8, 2021"}, {"text": "I asked a delivery from the store and, despite the apologies of the delivery guy (is not his fault) the food was bad served, totally salty and without taste even their yakitori were just one piece of chicken with a stick. I've complained with the...", "stars": "ui_bubble_rating bubble_10", "date": "December 4, 2020"}, {"text": "Seeing the reviews, my expectations were high but after trying Chinese, Indian, Brazilian and American menus I dont really like the food.\nI recommand this place for social media addicts :p", "stars": "ui_bubble_rating bubble_20", "date": "October 22, 2020"}, {"text": "Great restaurant, delicious food, nice workers and nice decor. What bette??? \nAllez-y sans hésiter😌😌", "stars": "ui_bubble_rating bubble_50", "date": "February 28, 2020"}, {"text": "we had really great time as family me my wife and my baby its was extremly delicious with severals various of dishes all around the world , i recomamded it .", "stars": "ui_bubble_rating bubble_50", "date": "February 7, 2020"}, {"text": "Very beautiful restaurant and the most exciting things food and decoration especially the good choice of Arabic calligraphy🤩❤️💘", "stars": "ui_bubble_rating bubble_50", "date": "October 31, 2019"}, {"text": "always nice to spend time at signature restaurant good coffee good ambience ❤️\neverything is clean and well presented with a beautiful decoration", "stars": "ui_bubble_rating bubble_40", "date": "September 27, 2019"}, {"text": "I had a great dinner there with various taste but the problem was that there is no English menu\nI ordered a salad and Lebanese dish also the signature cocktail \nAll was good and delicious", "stars": "ui_bubble_rating bubble_50", "date": "September 4, 2019"}, {"text": "Signature is the type of restaurant that doesn’t do a single type of cuisine.  Instead, it tries to be the master of many types of cuisine - Algerian, French, US, Italian, Lebanese, etc etc.  The food quality is good but it won’t be the best...", "stars": "ui_bubble_rating bubble_40", "date": "September 3, 2019"}, {"text": "It was amazing today,  lovely atmosphere with such a great food \nI would be more than happy to recommend this restaurant\nWell done signature 🤗🤗", "stars": "ui_bubble_rating bubble_50", "date": "August 22, 2019"}, {"text": "As a huge food fan who just moved to Algiers i am always looking for those places where food tastes like heaven and the place feels like home and i finally found one 🥰 after i saw their Instagram page and got a confirmation from...", "stars": "ui_bubble_rating bubble_50", "date": "August 19, 2019"}, {"text": "i really liked this place my friends took me there for my birthday, the staff were extremely nice and welcoming, the food was really good i really liked the pizza but there wasn't really a vegetarian option so i had to take the pizza which...", "stars": "ui_bubble_rating bubble_50", "date": "June 30, 2019"}, {"text": "Nice surprise, in the restaurant area of El Biar, Algerian traditional and also international foods. Professional service and price us ok. I recommend it", "stars": "ui_bubble_rating bubble_50", "date": "February 21, 2019"}, {"text": "Such a good address with good hospitality , The food was on point as always. One of the top restaurants.", "stars": "ui_bubble_rating bubble_50", "date": "December 2, 2018"}]},
{"name": "Restaurant Arabesque", "note": "4.5 of 5 bubbles", "reviews": [{"text": "Very tasty and very friendly. Good location. Actually they are guilty I missed other places as every evening I was back  for their food))", "stars": "ui_bubble_rating bubble_50", "date": "February 9, 2022"}, {"text": "The food is very tasty.  The price is very good for the quality of the food.. great menu. I ate 3 times and i want to eat onther time before i leave algeria", "stars": "ui_bubble_rating bubble_40", "date": "October 14, 2021"}, {"text": "It was difficult to find a casual restaurant of an evening in Algiers, but Arabesque proved to be a nice escape from hotel dining. The restaurant is conveniently located near Khelifa Boukhalfa metro station and the welcome was friendly. We ordered quite a selection of...", "stars": "ui_bubble_rating bubble_40", "date": "October 19, 2019"}, {"text": "The place is nice, large space in both floors with good air conditioning. They serve Syrian and international dishes. The waiters are available. We took Syrian appetizers , then main course, the food is really good. The only improvement point I suggested was to provide...", "stars": "ui_bubble_rating bubble_40", "date": "September 4, 2018"}]},
{"name": "Jenina", "note": "4.0 of 5 bubbles", "reviews": [{"text": "Amazing oriental restaurant,  where you can taste Algerian food in an excellent and quite atmosphere.", "stars": "ui_bubble_rating bubble_50", "date": "March 6, 2020"}, {"text": "I traveled to Algiers for the first time and landed in this restaurant for local food. It has colourful ambiance with a local vibe to it. They didn’t accept cards so had to to go back to the hotel to withdraw cash. \nWe got seated...", "stars": "ui_bubble_rating bubble_10", "date": "November 25, 2019"}, {"text": "After being closed for the month of August, Jenina re-opened its doors in September. The restaurant has ornate woodwork throughout & has a really great ambiance.  The menu is full of lots of Algerian traditional dishes, to include couscous, tajines, and méchoui.  I had the...", "stars": "ui_bubble_rating bubble_50", "date": "September 3, 2019"}, {"text": "مطعم الجنينة. \nالمطعم كان رحلة فريدة في كل شيئ.\nالطعام رائع و العاملين ودودين و الجو غاية الرومانسية.\nلقد إستمتعنا بكل لحظة قضيناها هناك.\n\nEl Djnena\nThe Resturant was Exceptional trip in every thing, the Food was delicious, the Staff warm and professional, finally the...", "stars": "ui_bubble_rating bubble_40", "date": "March 19, 2019"}, {"text": "This restaurant is definitely the best in town for Algerian food , limited menu but wonderful taste. Staff are friendly and professional, The prices however are high but fair for what you get", "stars": "ui_bubble_rating bubble_50", "date": "January 15, 2019"}, {"text": "I had arranged for a booking at El Djenina Restaurant for several reasons one of which was a family reunion in my hometown Algiers that doesn’t happen often to say the least…\nSo, a nice setting, quality service, and quality traditional dishes were a must!...", "stars": "ui_bubble_rating bubble_10", "date": "September 18, 2018"}, {"text": "Cosy atmosphere in this place without the restaurant being small. They serve great algerian cuisine and I couldn't help but go back the following day. Upon arrival you are welcomed with an appetiser of bread, tasty local olives and flavorful spicy (not hot) carrots. What...", "stars": "ui_bubble_rating bubble_40", "date": "August 7, 2018"}, {"text": "Very tasteful Algerian traditional meals... very nice historical building... well located... professional management...", "stars": "ui_bubble_rating bubble_50", "date": "June 18, 2018"}, {"text": "I felt bad that I didn't really enjoy this restaurant as I had read other reviews and was hoping for the just about the best place in Algiers to have local cuisine. I like high-end restaurants and have travelled extensively so am familiar with North...", "stars": "ui_bubble_rating bubble_30", "date": "May 7, 2018"}, {"text": "We were a quite big group and went to jenina twice. \nBoth times we were extremely satisfied. \nThe Algerian wine they serve is great and the food is traditional and very delicious. We particularly loved the artichokes and the traditional börek as well as the...", "stars": "ui_bubble_rating bubble_50", "date": "May 1, 2018"}, {"text": "The interior is amazing with arabesque patterns and traditional furniture. The food was perfect, a compilation of traditional and international dishes. Everything was tasteful. The stuff, simply perfect. Don't leave Algiers without visiting this restaurant.", "stars": "ui_bubble_rating bubble_50", "date": "April 22, 2018"}, {"text": "Lovely dinner in an exceptional setting full of character. Great service and good Algerian wine is served. Will definitely go back again.", "stars": "ui_bubble_rating bubble_50", "date": "March 11, 2018"}, {"text": "I visited the place more than once, and each time it has been a great experience both on service and quality.\nPrices remains on the high side but it worth every penny.\nStaff is professional, food (traditional) is delicious, the place in worm and authentic...", "stars": "ui_bubble_rating bubble_50", "date": "March 3, 2018"}, {"text": "Good Algerian food, pleasant surroundings, reasonably priced. Service was a little slow but we were in no hurry so it didn’t matter.", "stars": "ui_bubble_rating bubble_40", "date": "February 22, 2018"}, {"text": "For me the best restaurant in Algiers. Traditional dishes recommendable, acceptable Algerian wines, nice service. Expensive but worthy.", "stars": "ui_bubble_rating bubble_50", "date": "February 19, 2018"}]},
{"name": "Le Bardo", "note": "4.5 of 5 bubbles", "reviews": [{"text": "Visited on a Monday night at 7:15pm.  Was seated on top floor in their non-smoking area.  Had the shrimp dish & it was good.  The shrimp were cooked & seasoned well & the rice was also well seasoned.  I was too full for dessert but...", "stars": "ui_bubble_rating bubble_40", "date": "September 9, 2019"}, {"text": "An elegant restaurant.\nPleasant and peaceful lacation.\nThe staff is prepared, kind and polite.\nGreat choice on the menu.\nExcellent wine selection.\nFoods of excellent quality", "stars": "ui_bubble_rating bubble_50", "date": "August 19, 2019"}, {"text": "This was the second time I visited “Le Bardo” in Alger. \n\nMy previous experience with the food here was far superior compared to last nights visit, indicating a problem with consistency in the kitchen. \n\nThe food we have ordered where below average in my opinion....", "stars": "ui_bubble_rating bubble_40", "date": "May 4, 2019"}, {"text": "Very beautiful place, happy atmosphere, stuff very friendly. The food was of high quality. The soup was delicious but the beef tongue was absolutely perfect, the most tender meat I have ever tried.", "stars": "ui_bubble_rating bubble_50", "date": "April 22, 2018"}, {"text": "This is quite likely the best restaurant in town. Esquisit menu and well prepared courses. An extensive wine list and wonderfuk desserts makes  it a  feast to the  most  demanding. The deco is nice  and very sophisticated. Staff is efficient and well formed. Be aware...", "stars": "ui_bubble_rating bubble_50", "date": "April 16, 2018"}, {"text": "Le Bardo restaurant - Algiers \n\nWe booked a table of 7 for a special occasion, as I had already been invited to this restaurant. \n\nAs Algerian restaurants go, it is good. Service is polite, toilets are clean. Decor is a bit drab, a leftover from...", "stars": "ui_bubble_rating bubble_30", "date": "April 6, 2018"}, {"text": "Service is excellent. Food is very good quality with subtle nuance of flavor and seasonings. Delightfully they offer the option of a non-smoking dining room.  The warm goat cheese and salad was delicious and beautifully presented.  Everyone in our group enjoyed the food very much....", "stars": "ui_bubble_rating bubble_50", "date": "January 7, 2018"}, {"text": "The best Algerian food ever tried. \nThe Kebab Tadjin was amazing. \nGreat service , Food is amazingly tasty and good portions.", "stars": "ui_bubble_rating bubble_40", "date": "December 15, 2017"}, {"text": "Delicious Food , very nice and causy atmosphere , very good services , nice choice à la carte , nice wine list .. we had a great dinner and moment .. Algerian and Mediterranean cuisine . Best restaurant i have experienced in Algiers so far...", "stars": "ui_bubble_rating bubble_50", "date": "December 15, 2017"}, {"text": "Nice restaurant, with a good menu, whilst they do offer fish I would say it is more a meat restaurant and what they serve is excellent.  Good, swift and professional service. Think is is more a business restaurant !", "stars": "ui_bubble_rating bubble_40", "date": "September 28, 2017"}, {"text": "I came here for lunch after visiting the Bardo Museum, just up the hill. Everything was wonderful -- from the food to the service to the presentation to the ambiance. I started with the Kémia: I loved the pepper and eggplant salads; if I hadn't...", "stars": "ui_bubble_rating bubble_50", "date": "August 14, 2017"}, {"text": "A must pass by in Algiers as one of the best places to dine in. Great choices and dishes. The portions are really generous.", "stars": "ui_bubble_rating bubble_50", "date": "May 28, 2017"}, {"text": "The food is good and fine, and the atmosphere and service is better. Very good waiters and service. .", "stars": "ui_bubble_rating bubble_40", "date": "December 28, 2016"}, {"text": "Great atmosphire, dilicious food specially the pumpkin soup and the tenderloin steak, 7 star service. One of my best experience in Algiers.", "stars": "ui_bubble_rating bubble_50", "date": "November 13, 2016"}, {"text": "My boyfriend and I went to this restaurant for a special occasion. Firstly I will say it's not cheap. For Algiers standards it's very expensive. However it was ok for us because it was a special occasion and also because we knew it's an expensive...", "stars": "ui_bubble_rating bubble_50", "date": "October 12, 2016"}]},
{"name": "Restaurant Aladin", "note": "4.0 of 5 bubbles", "reviews": [{"text": "I spent almost 1 hour waiting for my order, the salad was good, the Chich Taouk sandwich is tasteless; full of fries, and so oily!\n\nThe waiter downstairs is so slow, and unprofessional.", "stars": "ui_bubble_rating bubble_20", "date": "June 12, 2019"}, {"text": "You would be amazed by the cheap shawarma but it’s tasteless n half full of fries. So try somewhere else on the same street.", "stars": "ui_bubble_rating bubble_20", "date": "January 27, 2018"}, {"text": "Arriving back at our (restaurant-less) hotel late one evening in Algiers during our recent holiday we asked where we could find somewhere to eat.  The hotel staff directed us to the nearby Aladin.  My wife is vegan and we weren't too sure when we passed...", "stars": "ui_bubble_rating bubble_50", "date": "November 4, 2017"}, {"text": "I have been to this restaurant twice in the last week. Being a foreigner I still liked the food taste. The service people spoke English.  Typical Mediterranean taste...good for family, friends ...", "stars": "ui_bubble_rating bubble_40", "date": "August 24, 2016"}]},
{"name": "Azzurro", "note": "4.5 of 5 bubbles", "reviews": [{"text": "When we approached the restaurant, I was warmly and professonally welcomed and taken care of by the hostess Ms Louiza. I had the se bass carpatio for starter, fillet de beuf for main course and white chockolate for dessert, served by the friendly waiter Lounes....", "stars": "ui_bubble_rating bubble_50", "date": "January 17, 2020"}, {"text": "I had two lovely meals at Azzurro while in Algiers for business. Lounes was our waiter and he was fantastic - very polite and attentive all the time. Thank you.", "stars": "ui_bubble_rating bubble_40", "date": "December 16, 2019"}, {"text": "The hostess Louiza is very friendly and professional and is always greeting us with a smile and help us to get a good start for our evening. The food is very good. Do not be afraid to ask for extras with your food, but be...", "stars": "ui_bubble_rating bubble_40", "date": "March 15, 2019"}, {"text": "We had a great dinner in Azzurro, Sofitel. It was a real pleasures to hold a great business dinner. Good food and  excellent Staff. Special thanks for Ms. Louisa, karim, ramses, lounes.", "stars": "ui_bubble_rating bubble_50", "date": "February 11, 2019"}, {"text": "The food in the restaurant is really great and I never has any menu which note taste good. My favorite are the lamb chops. Also all staff from the restaurant is really friendly and have a great service", "stars": "ui_bubble_rating bubble_50", "date": "January 23, 2019"}, {"text": "Azzurro offers great Italian food, a nice wine selection and wonderful service.  They have a wide variety of Italian dishes incuding meat, fish and pasta.  Waiters Karim and Massi are wonderful hosts who know the menu very well, are good at what they do and...", "stars": "ui_bubble_rating bubble_50", "date": "January 17, 2019"}, {"text": "Louiza was a perfect hostess, very careful with the hosts.\nThe dishes are very well prepared and good local wine.\nMany thanks for your hospitality. See you next time.", "stars": "ui_bubble_rating bubble_40", "date": "December 17, 2018"}, {"text": "Have spent a good chunk of time  in Algiers and it was a \"first\" visit to the Azzurro, but won't be the last.  An expensive meal, but we all felt it was worth the price for both the quality of the food and the service...", "stars": "ui_bubble_rating bubble_40", "date": "June 5, 2018"}, {"text": "I've eaten here several times as I stay frequently at the Sofitel Hamma Garden Hotel. Every dish I've had has been superb and served with unique accompaniments. They have recently renewed their menu and  I can highly recommend the carpaccio, the filet de dorade, the...", "stars": "ui_bubble_rating bubble_40", "date": "March 24, 2018"}, {"text": "Great dinning environment . Good team I am particularly impressed with one young waiter guy named  Younas.", "stars": "ui_bubble_rating bubble_50", "date": "March 12, 2018"}, {"text": "wonderful evening at the restaurant Azzuro, thank you to Hamid and Rameses thanks to you I had a great time with my friend. Big up to the chef Hanan you really take me to Italy.\nVery satisfied certainly and for sure i will certainly come...", "stars": "ui_bubble_rating bubble_40", "date": "October 27, 2017"}, {"text": "I was staying in the hotel, so decided to eat in the well recommended French restaurant.  It was excellent and I really did enjoy my veal, macaroni and salad.\n\nThe staff were professional, although I did think they were a little to professional and working...", "stars": "ui_bubble_rating bubble_40", "date": "October 10, 2015"}, {"text": "Very old school french (with beautifully turned veg)....  It was like going back in time and eating in the eighties.  Veal was good and dessert excellent", "stars": "ui_bubble_rating bubble_30", "date": "June 5, 2015"}, {"text": "Came here with my sister as we were guests at the Sofitel hotel and fancied having a sophisticated continental meal. Delicious amuse-bouche offered by the chef - carpaccio of spicy prawn. My sister had the sole and I had the duck- both were exquisite. Attention...", "stars": "ui_bubble_rating bubble_40", "date": "April 4, 2015"}, {"text": "We were invited here for dinner at this restaurant situated inside Sofitel. I loved the mini soup offered by the chef upon our arrival. So yummy and we couldn't identify what was in it. But it was really good. I ordered ravioli as an entree...", "stars": "ui_bubble_rating bubble_50", "date": "February 8, 2014"}]},
{"name": "Arabesque Restaurant", "note": "4.5 of 5 bubbles", "reviews": [{"text": "The place is great!\nThe waiters are polite and friendly. Food is delicious and beautifully presented.\nMocktails also are tasty and fresh:)\nWith my children we visited already twice, and planning to come back while in  back to Algiers.\nThanks again for your hard work!!", "stars": "ui_bubble_rating bubble_50", "date": "May 27, 2023"}, {"text": "One can tell an excellent restaurant by the line that waits to enter and this is one of those. The food is fabulous! We had the large platter of cold entrees such as hummus and labneh. It was delightful for us vegetarians and we even...", "stars": "ui_bubble_rating bubble_50", "date": "November 8, 2022"}]},
{"name": "Le pere jego", "note": "4.0 of 5 bubbles", "reviews": [{"text": "Cozy restaurant with good service and diversified menu.\nNear to the downtown and there is places where to park", "stars": "ui_bubble_rating bubble_40", "date": "October 20, 2017"}, {"text": "I doubt people can appreciate a dinning place based on the food . \n\nToo dark to see your plates ,  service up nose", "stars": "ui_bubble_rating bubble_10", "date": "February 9, 2017"}, {"text": "Here is a restaurant one must visit in Algiers. With a superb view over Algiers bay, this a cosy well decorated and sophisticated restaurant. With a professional and friendly staff, Le Pere Jego serves a wide variety of international dishes but also magrebian inspired dishes...", "stars": "ui_bubble_rating bubble_50", "date": "April 24, 2016"}, {"text": "Get ready for the crowds Algierians, with so few reviews to go on for our trip to Algiers, we have found a gem. Absolutely delicious! Prices for  3 courses with a wide selection of menu items, and a shared bottle of delicious Algerian wine was...", "stars": "ui_bubble_rating bubble_50", "date": "April 21, 2016"}, {"text": "I was suprised with this resto. I had never heard about it. It was a wonderfull dinner. Amazing view, well decorated, very good service. Definetly a place to go back. Should be in top 3 of Algiers.", "stars": "ui_bubble_rating bubble_50", "date": "December 30, 2015"}, {"text": "another middling Algiers resto with pretentions to be something more. Arrived late to make up group of 4, and the waiter didn't think to offer me a menu or ask if I wanted a drink. No alcoholo by the way. Kidneys were a bit chewy....", "stars": "ui_bubble_rating bubble_30", "date": "May 12, 2015"}, {"text": "This is an excellent restaurant, presentation of the dishes were very nice and all the dishes, we ordered were taste really good. I tried ravioli as starter and lotte grill as main dish. Also, the atmosphere of the restaurant was really romantic. It is undiscovered...", "stars": "ui_bubble_rating bubble_50", "date": "August 18, 2014"}]},
{"name": "Woody Grill", "note": "3.5 of 5 bubbles", "reviews": [{"text": "Woody’s Grill is a high quality, no regrets kind of place in the center of Algiers. Having spent the day walking around Algiers finding other restaurants either closed or low quality, Woody’s was a treat to find. The food was good, the service exceptional.", "stars": "ui_bubble_rating bubble_50", "date": "December 30, 2022"}, {"text": "I felt compelled to write a review after visiting Woody Grill twice, because I had very positive experiences both times at this restaurant. I'm an American, and it's been hard for me to find the kind of quality restaurant food, atmosphere, and service in Algeria...", "stars": "ui_bubble_rating bubble_50", "date": "September 27, 2019"}]},
{"name": "Restaurant de L'Universite", "note": "3.5 of 5 bubbles", "reviews": [{"text": "Very good and tasty food with really good service and very helpful manager ..looking forward to visit next time", "stars": "ui_bubble_rating bubble_50", "date": "July 12, 2023"}, {"text": "Despitethe fact the food was clearly reheated, the service, the goodwine and the easy going atmosphere make this a place I would perhaps recommend on a day when the cooking is fresher.", "stars": "ui_bubble_rating bubble_30", "date": "November 16, 2019"}, {"text": "This was my first travel to algeria. I have enjoy  a lot with my family and my children. This was my first tour with family and i never forget this travel.", "stars": "ui_bubble_rating bubble_50", "date": "April 22, 2019"}, {"text": "This is the spot to fix your late night alcohol cravings. After dinner, people come here to have another drink (and another and another). You'll meet expats and locals alike, and women are occasionally part of the clientele.", "stars": "ui_bubble_rating bubble_40", "date": "July 6, 2017"}, {"text": "came to eat here for our first night in alger. nice place modern with fresh fish at the front door.\nwe were brought a small entree offered from the house\nwe started with some grilled prawns and soup that were both very good to finish...", "stars": "ui_bubble_rating bubble_30", "date": "January 28, 2014"}, {"text": "Poor food, limited choice, average service, dirty toilets and over priced!\nDon't waste your time looking for fine dining or authentic traditional local cuisine in Algiers - there isn't any as locals can't afford it and there aren't enough tourists to justify it.", "stars": "ui_bubble_rating bubble_10", "date": "December 29, 2013"}, {"text": "This was a repeat visit for me and among the four of us (two who had never been), we were all impressed with the menu. Fusion of Algerian and European cuisine. Service and setting were professional and enjoyable. Located on the main street in central...", "stars": "ui_bubble_rating bubble_50", "date": "June 7, 2013"}]},
{"name": "La Renaissance Restaurant Bistro Cafeteria", "note": "3.5 of 5 bubbles", "reviews": [{"text": "Unfortunately most of the restaurant option at Algiers City centre became crowded and noisy fast food joints. The Renaissance is an oasis at Didouche Mourad main street. A restaurant with a classical touch and a cosy atmosphere. The meals are well cooked and nicely presented...", "stars": "ui_bubble_rating bubble_40", "date": "February 27, 2023"}, {"text": "This is a convenient restaurant at the city's main Street at a raisonable price and quality. At strange as it might seems there are not that many good budget restaurant in the city centre since whether they are sophisticated and expensive or they are low...", "stars": "ui_bubble_rating bubble_30", "date": "December 23, 2018"}, {"text": "Place in city centre is nice and cozy.\nBut service is poor.\nWaiters should continously take care of customers.  After you order they forget you. \nThe cashiee thinks only about payments. The bar man only about bar.\nManagement should explain to everyone how to follow...", "stars": "ui_bubble_rating bubble_40", "date": "December 1, 2018"}]},
{"name": "Cafe Eddy", "note": "4.0 of 5 bubbles", "reviews": [{"text": "This is a lovely little coffee shop located on the busiest shopping street in the city. It offers a pleasant environment, friendly and and helpful staff, most of whom speak some English, and of course, good coffee at very reasonable prices. The toilets are also...", "stars": "ui_bubble_rating bubble_40", "date": "February 18, 2021"}, {"text": "This is a place where I loved to relax over a cup of coffee and one of the many pastries. The Wi-Fi is decent and as non-french speaker the staff really accommodated me.\n\nBe warned though that they serve drinks, Gelato and pastries. If you...", "stars": "ui_bubble_rating bubble_40", "date": "July 26, 2018"}, {"text": "Lovely café. Excellent coffee. Friendly service. Staff spoke English. Popular, shared a table with some lovely locals. A good mix of men and women, the way it ought to be in my humble opinion. Who doesn’t like to pop out for coffee? Pleasant ambiance. Hope...", "stars": "ui_bubble_rating bubble_50", "date": "July 4, 2018"}]},
{"name": "Jenina", "note": "4.0 of 5 bubbles", "reviews": [{"text": "The place is located in Algiers Center.\n\nWe actually searching on the internet looking for a good place to have a local food like Couscous and we ended up choosing Jenina Restaurant.\n\nThe decor inside is not well conditioned, the table was broke.\n\nThe service...", "stars": "ui_bubble_rating bubble_20", "date": "December 27, 2017"}, {"text": "I came here after the resturant was recommended by a local. Algiers's food scene is underdeveloped to say the least, but Jenina was great. Maitre'de took my reservation over the phone and welcomed me when I arrived. Had delicious lamb tajine with couscous and vegetable....", "stars": "ui_bubble_rating bubble_40", "date": "November 20, 2017"}, {"text": "A good one for business dinners, it's architecture and decoration makes of it a unique piece in Algiers, very marked by tradition and originality. \n\nEnjoy your meals (:", "stars": "ui_bubble_rating bubble_40", "date": "September 10, 2017"}, {"text": "Food is good but overpriced in my opinion.  Service is poor; instead of bringing a dish directly to the person who ordered it, waiters would stand by our table (we were a group of 10 or 12 people ) and shout out the name of...", "stars": "ui_bubble_rating bubble_30", "date": "August 8, 2017"}, {"text": "Beign Algerian does not help at all.\nI mean, yes the restaurant is nicely decorated and the waiters are good.\nThe food is, however, completely awful.\nI ordered Couscous and it was obviously heated in the microwave as it was totally cold in the middle...", "stars": "ui_bubble_rating bubble_10", "date": "August 7, 2017"}, {"text": "Place where you will feel the authentic atmosphere of Algeria and will be served with the modern requirements. \nThe food is prepared fresh, and according to the given by the Mediterranean Sea in the day. \nYou will experience the unique combination of local food traditions...", "stars": "ui_bubble_rating bubble_50", "date": "July 13, 2017"}, {"text": "Had some algerian good, it was amazing. Overpriced, but must try.\nUsually close around two o'clock, and the best time to visit is at 7 sunset time", "stars": "ui_bubble_rating bubble_40", "date": "July 10, 2017"}, {"text": "Lovely restaurant in a historic building with beautiful old Arabic style decor in the inside.  There are a couple of windows that look out over the port and sea.  As a vegetarian I found the food very good with a tomatal based salad dish for...", "stars": "ui_bubble_rating bubble_50", "date": "May 21, 2017"}, {"text": "Extremely expensive and food quality is far below what you are paying for...tables are too close to each other that you have no privacy for a business discussion...stay away from Couscous with honey plate it is really not nice at all and the lamb is...", "stars": "ui_bubble_rating bubble_20", "date": "May 17, 2017"}, {"text": "As with most of the more expensive restaurants in Algiers, you go for the surroundings and because you can get a glass of wine with your meal, rather than for what is on the plate. Five of us had a pleasant evening, but it was...", "stars": "ui_bubble_rating bubble_30", "date": "March 24, 2017"}, {"text": "As this restaurant serves alcohol the door has by law to be locked and will only be opened to you when you ring the bell high on the wall to your right! Once we had overcome this difficulty we were rewarded with  local food that...", "stars": "ui_bubble_rating bubble_50", "date": "March 7, 2017"}, {"text": "Nice authentic Algerian atmosphere. Food is good also, Algerian fare. Service also. Nice place for authentic Algerian cuisine in a private setting.", "stars": "ui_bubble_rating bubble_40", "date": "December 28, 2016"}, {"text": "Excellent vibe, superb food and great service.  Owner makes the experience complete!\nThank you Allegorie for introducing us!", "stars": "ui_bubble_rating bubble_50", "date": "December 5, 2016"}, {"text": "Great location, in refurbished Ottoman building. Typical Algerian cooking well described by skilled waiters. Absolutely to taste \"mechoui\" and \"tajin\" (lamb based), with dessert. Surely I'll back.", "stars": "ui_bubble_rating bubble_40", "date": "November 24, 2016"}, {"text": "I was entertained by my colleagues at Jenina.  Very good menu with wide choices of local cuisine.  I had a delicious couscous with chicken - tender and tasty.  Service was excellent.  Decor was great and gave a good feeling of what the architecture was like....", "stars": "ui_bubble_rating bubble_40", "date": "November 6, 2016"}]},
{"name": "Caviar D'Or", "note": "4.0 of 5 bubbles", "reviews": [{"text": "We had a very nice evening in that restaurant, drinking \"Mojito\" and eating a lot of sea food including various fishes. Nice service in various languages and the restaurant was fully booked.", "stars": "ui_bubble_rating bubble_50", "date": "February 8, 2023"}, {"text": "One of the best fish restaurant in Algiers region. Fresh juicy fish and a nice view over the dock and it's nice cosy terrace.", "stars": "ui_bubble_rating bubble_40", "date": "August 18, 2016"}, {"text": "Went there to eat fresh fish. The restaurant is rather simple, and is unfortunately dry (alcohol free). It works like a fish market restaurant: we selected the seafood we wanted, asked the kind of cooking we wanted and ... ate it! Simple, but rather good!...", "stars": "ui_bubble_rating bubble_40", "date": "April 9, 2016"}, {"text": "Excellent fish restaurant at the Madrague, I had fish soup and royal shrinp xxxxx as starters, swordfish as the main course and excellent Algerian bread. No wine of course, it all went down to 17 euro per person. It was lunchtime and evenings are crowded...", "stars": "ui_bubble_rating bubble_50", "date": "March 28, 2016"}]},
{"name": "Kheimat Essaoura", "note": "4.5 of 5 bubbles", "reviews": [{"text": "Unfortunately it is the second time we go to the restaurant, as friends we have in Algiers like the setting. Food is extremely bad. The lamb in the couscous was impossible to eat because it was simply too hard, the tagine supposedly with lemons didn’t...", "stars": "ui_bubble_rating bubble_10", "date": "April 29, 2018"}, {"text": "Traditional restaurant serving couscous et tajines in a smart setting with table cloths and napkins.  Good food at reasonable prices, pleasant staff although very few customers at the time of our visit.", "stars": "ui_bubble_rating bubble_50", "date": "December 1, 2016"}, {"text": "We came here for dinner after a daytrip to Tipasa. Good selection of traditional Algerian dishes available here including quite a few involving various types of offal: be careful what you order! We opted for one of the traditional stews and some\nsoup. Very happy...", "stars": "ui_bubble_rating bubble_40", "date": "March 16, 2015"}, {"text": "This is a must visit restaurant in central Alger.  Small restaurant serving Alger's Couscous, Chakhchoukha and several other dishes \nYou will sit on benches and covered stools around a large sized coffee table.  The services and attention to quality of food is first class.\nDo...", "stars": "ui_bubble_rating bubble_40", "date": "March 6, 2015"}]},
{"name": "Le Repere", "note": "4.5 of 5 bubbles", "reviews": [{"text": "I first stopped at this cute patio cafe located in the Haute (upper) Casbah two years ago for mint tea. Somehow it feels like you are visiting old friends and I just fell in love with it. I had hoped to go there again and...", "stars": "ui_bubble_rating bubble_50", "date": "October 4, 2017"}, {"text": "Thanks to Djawla Assimia and our tour guide Kenza, we landed in this beautiful little restaurant with its extremly appealing charm and delicious food !\nThe sardines were so tasty with the local salads, the atmosphere very warm and cosy, the place is loaded with...", "stars": "ui_bubble_rating bubble_50", "date": "September 27, 2017"}]},
{"name": "Brasserie des Facultes", "note": "3.5 of 5 bubbles", "reviews": [{"text": "We came here every night during our week’s stay in Algiers. Sometimes we ate, but more often we just drank some draught beers. \n The woman who works there and greeted us each evening, is very hardworking, friendly and professional. \n We really liked the place and...", "stars": "ui_bubble_rating bubble_50", "date": "June 4, 2023"}, {"text": "This is one of the last brasseries at Algiers. Most of the restaurants serving alcohol are closing down due to the growing non alcohol governmental policies. Les Faculté keeps the charm of those old brasseries that used to existe at the city centre some decades...", "stars": "ui_bubble_rating bubble_30", "date": "February 27, 2023"}, {"text": "I've been there many times, mostly for paella day (on Wednesdays); it's a really nice place, the staff is also nice and the food amazing. They also serve alcohol so u can enjoy it then take a taxi (drink responsibly) available right in front of...", "stars": "ui_bubble_rating bubble_50", "date": "August 7, 2019"}, {"text": "It is an antiquated joint frequented by University faculty at some point. I had a beer & steak with pickled green pepper. Very good meal. Highly recommended", "stars": "ui_bubble_rating bubble_40", "date": "April 18, 2019"}, {"text": "Nice dinner in a tradictional restaurant in Algiers! From couscous to steak, everything was really good!", "stars": "ui_bubble_rating bubble_50", "date": "October 9, 2018"}, {"text": "This restaurant is no longer just for men. It is licensed, a relaxed but very \"correcte\" place, and reasonable.", "stars": "ui_bubble_rating bubble_40", "date": "May 4, 2018"}, {"text": "Nice welcome and service but food sucks! French fries were from few days reheated while gambas were tasteless.. very disappointed by brasserie food usually it’s good n fresh.", "stars": "ui_bubble_rating bubble_20", "date": "January 27, 2018"}, {"text": "The restaurant is somehow staid frozen in 70-80-ies, when it was still allowed to smoke in the public places. Most of the guest are actually smoking, which is disturbing because there is no other non-smoking area. If you are resistant to smoke, the food is...", "stars": "ui_bubble_rating bubble_40", "date": "December 27, 2017"}, {"text": "Just off the Grande Poste square, this charming restaurant with its happy welcoming staff server an excellent range of traditional food. We had Couscous (make sure you have a big appetite , the serving is very generous in size) and Mechouia.\nBoth were very tasty....", "stars": "ui_bubble_rating bubble_40", "date": "November 3, 2017"}, {"text": "This is the kind of brasserie you will find in an average French city. Instead it is in the Rue Didouche Mourad, right in the center of Algiers. I visited several times and especially enjoyed the couscous. Value for money! The restaurant is always open,...", "stars": "ui_bubble_rating bubble_40", "date": "September 26, 2017"}, {"text": "One great thing about this brasserie is that it's always open, also on Fridays and national holidays. The lightning could improve but the quality of the food made up for that. The served portions are gigantic yet tasteful. Alcohol is served.", "stars": "ui_bubble_rating bubble_50", "date": "July 6, 2017"}, {"text": "I thought it was a really good inexpensive option and it was very reasonable and so close to the GRAND POST . I loved the ambiance and the waiters were really friendly and accomondating", "stars": "ui_bubble_rating bubble_50", "date": "August 11, 2015"}, {"text": "Came here for dinner tonight and selected one of the fish which was then cooked to perfection and served with a range of vegetables. Wine is available at reasonable prices and the salads for starters are also good. Worth a visit.", "stars": "ui_bubble_rating bubble_40", "date": "March 19, 2015"}, {"text": "this feels like a normal restaurant with normal people in it. Prices are good by Algiers standards and being on Didouche Mourad, it is well placed for dropping in to, if not for finding a parking space. Likeable and quick on the food front. Not...", "stars": "ui_bubble_rating bubble_40", "date": "May 11, 2014"}, {"text": "We were wandering around Algiers, terribly jet lagged, trying to find a place to have a nice lunch on a Friday.  Hmmm..  Just as we were  about to give up, we heard the clatter of a very busy restaurant.  So we walked in and ordered...", "stars": "ui_bubble_rating bubble_40", "date": "May 9, 2014"}]},
{"name": "Zhori Restaurant", "note": "4.0 of 5 bubbles", "reviews": [{"text": "Zohri was one of my favorites restaurants in Algiers between 2014 to 2020. I’ve revisited Algiers in 2022 and of course went back to Zohri. What a big mistake! The cook is new and doesn’t even deserve the title cook set aside chef or cuoco...", "stars": "ui_bubble_rating bubble_10", "date": "July 30, 2022"}, {"text": "This is probably the best Italian restaurant in Algiers. Great options and wide Italian list with wonderful gnocchi and pastas", "stars": "ui_bubble_rating bubble_40", "date": "November 23, 2019"}, {"text": "The best restaurant so far, adored everything about it, & the food oh god so delicious. A great service too.", "stars": "ui_bubble_rating bubble_50", "date": "July 1, 2019"}, {"text": "I was in Alger for work and some friends tipped me on this hidden gem. Amazing Italian kitchen and great hospitality from all the staff! I wish I live closer to go back soon! I don’t usually make reviews but ZhorÍ deserves one.", "stars": "ui_bubble_rating bubble_50", "date": "October 18, 2018"}, {"text": "Little bit high priced, but can enjoy excellent dish and service in the cozy atmosphere. Definitely worthy to visit.", "stars": "ui_bubble_rating bubble_40", "date": "February 13, 2018"}, {"text": "You can find this restaurant in el biar , it's a typical Italian restaurants very good food and nice service , how ever it is over priced you would pay for lunch for 2 people around 15000dinar = 120€ and the servers expect tips. \nBut...", "stars": "ui_bubble_rating bubble_40", "date": "January 26, 2017"}, {"text": "As for italian food, in any other place in the world, this would be a bad restaurant with bad reviews. Since it's in Alger, where restaurants are scarce, it's OK but really not worth it.", "stars": "ui_bubble_rating bubble_30", "date": "July 3, 2016"}, {"text": "Had a very nice dinner at this restaurant with pasta and some other Italian dishes, the meet was also cooked to perfection, so a very nice experience!", "stars": "ui_bubble_rating bubble_50", "date": "April 26, 2016"}, {"text": "Yes it's a nice location, great view, different nice ambience... however the quantity of food served is too small, good for weight watchers. Prices are extremely high compared to quality/quantity matrix. Nice and friendly servers, but truly it's a one time experience.", "stars": "ui_bubble_rating bubble_20", "date": "October 31, 2014"}]},
{"name": "Le Normand", "note": "4.0 of 5 bubbles", "reviews": [{"text": "An inconspicuous but atmospheric French style restaurant in the centre of town, with a good range of grilled and braised meat and lighter starters, and good service.  Serves wine (mostly red): the patron recommend an impressive local wine from Tlemcen.  Expensive by Algerian standards but...", "stars": "ui_bubble_rating bubble_40", "date": "March 4, 2019"}, {"text": "This is for me my reference restaurant in Algiers. An old traditional restaurant with a deco that takes us back to the late 30s when Algiers was still a french colonial territory. The deco is wonderfull and cosy, the staff is very professional and friendly,...", "stars": "ui_bubble_rating bubble_50", "date": "April 25, 2016"}, {"text": "This place offers a large variety of French specialties, I have been there for a business occasion and really enjoyed my dinner; the beef filet was excellent and tender with perfect cooking, the crème caramel was home made and the service friendly and efficient. Definitely...", "stars": "ui_bubble_rating bubble_40", "date": "November 12, 2014"}, {"text": "Great food and good wine with French prices to match.  Nice interior with reproduction Brughel the Elder paintings on  the walls.  Seafood was fresh and the lamb shank excellent.", "stars": "ui_bubble_rating bubble_40", "date": "October 7, 2014"}, {"text": "If you like French food, this small old restaurant is for you!  Built in 1942, it has served meals for over seventy years.  The interior is like walking into a small museum.  The food is tasty, but smaller portions, good wine and desserts.", "stars": "ui_bubble_rating bubble_40", "date": "August 10, 2014"}, {"text": "dined here during the World Cup. Rue Tancredi is not on maps, which is the major hassle - just go up Mhidi Larbi from the Poste and this is in the first grotty street on the left. Yellow awning. Food def v francophone (pas de...", "stars": "ui_bubble_rating bubble_40", "date": "June 18, 2014"}, {"text": "This is probably the only real restaurant that worth a visit in Alger.\nLocated in the city center (not easy at all to park in the area and, to see the restaurant in the little street the first time), it offers the meal you don't...", "stars": "ui_bubble_rating bubble_50", "date": "June 1, 2014"}, {"text": "Ok, at first it is difficult to park if you are driving, but once you leave this hassle behind, you will be ready for a real nice time at this restaurant located in a very dynamic area of Algiers. The food is good and the...", "stars": "ui_bubble_rating bubble_40", "date": "November 25, 2013"}, {"text": "A very limited menu, but a proof of freshness. One of the oldest restaurants in Algiers, closed during the sad war, and now opened. The meat is great, the wine selection includes spanish and french choices.", "stars": "ui_bubble_rating bubble_40", "date": "August 29, 2013"}, {"text": "Food is super classic French, if you are looking for something else, this is not the place. Foie Gras, escargots, etc... All served to perfection. \nWine list was good and the waiter's advice was spot on. \nDeserts were superb: apple tart, strawberries, creme brulee...\nI...", "stars": "ui_bubble_rating bubble_50", "date": "April 26, 2013"}, {"text": "It is the locatad near the center of Alger. French style restrunt. As usual, we ordered wine,escargot, veil steak (T-bone), Apple tart, and coffee. The restrunt is Classic, traditional and confortable.", "stars": "ui_bubble_rating bubble_50", "date": "February 25, 2013"}, {"text": "Let's start with the pros: the restaurant has a cozy ambiance and professional and friendly service. They claim to have wide selection of wine (rare in Algiers) but the night we were there we were told that they have NO French wine whatsoever (there are...", "stars": "ui_bubble_rating bubble_20", "date": "February 15, 2013"}, {"text": "But our experience was disappointing, service was slow, and food was not good at all. Filet de Bouef was full of fat!", "stars": "ui_bubble_rating bubble_30", "date": "July 12, 2012"}, {"text": "A really good night out. Cosy restaurant with very friendly service, and good French food. The wines are also generally good. The usualy good Algerian reds such as Cuvée Monica, as well as some Italian and Spanish inspired wines. One of the waiters has been...", "stars": "ui_bubble_rating bubble_40", "date": "January 24, 2012"}, {"text": "What a delight to see an old world restaurant still producing wonderful French cuisine. It has some great  dishes not readily available in Algiers, Duck, Escargot, Scallops etc. Food excellent, ambiance great and serves alcohol. Only downside is parking. If you want to go there...", "stars": "ui_bubble_rating bubble_40", "date": "January 24, 2012"}]},
{"name": "La Grotte Des Saveurs", "note": "4.0 of 5 bubbles", "reviews": [{"text": "The food menu was band with odd choices.  We had tagliatelle aux fruits de mer is a dish that was dissapointing where  it consisted of only one  shrimp and 2 mussels  and left with a pile of pasta,  The shrimp on the pasta was overcooked...", "stars": "ui_bubble_rating bubble_30", "date": "December 24, 2016"}, {"text": "Although we were the only diners (perhaps because it's said they're closed on Sundays, which they obviously weren't), the food was very good and freshly prepared. We even got a complimentary mint tea at the end, very nice indeed.\nCan't complain about this place, except...", "stars": "ui_bubble_rating bubble_40", "date": "September 25, 2016"}, {"text": "I've been once during my last business trip and probably it won't be the last one. Quick and friendly service, food was fine and it is very decorated as a cave. To non muslim guests: no alcohol served.", "stars": "ui_bubble_rating bubble_30", "date": "March 15, 2016"}]},
{"name": "Signature", "note": "4.0 of 5 bubbles", "reviews": [{"text": "First visit to this restaurant the services is the worst ever the waiters are helpless the restaurant smoking friendly and no suitable for family with kids .\nReflecting the poor experience \nNot good value for money first time and the last time \nVery disappointed never...", "stars": "ui_bubble_rating bubble_10", "date": "November 7, 2018"}, {"text": "It was my first time , i tried this restaurant and i really like their burger and their decor i recommend  it for you .", "stars": "ui_bubble_rating bubble_50", "date": "August 29, 2018"}, {"text": "It really nice place u will find every thing from all the word algerian franch indian and more (tous les cuisine de tout le monde)\nTry it and not exepensive 😙😙", "stars": "ui_bubble_rating bubble_50", "date": "October 24, 2017"}, {"text": "We wanted to have some different kind of food and they served us the indian platted and the same was very good", "stars": "ui_bubble_rating bubble_40", "date": "May 9, 2017"}, {"text": "+ the adornment, the food was tasty and satiating, large area , the downside is the serving: a little bit slow I wonder if it's like that everyday, even though the restaurant wasn't full . Otherwise would definitely go back.", "stars": "ui_bubble_rating bubble_40", "date": "April 12, 2017"}, {"text": "The best food they offer is only the delicious pizza, i have tried Lebanese dishes, grilled assorted plate and the Asian appetizer called aisatique, unfortunately none of them met my expectations, grilled plate was almost burnt, other dishes were oily.", "stars": "ui_bubble_rating bubble_20", "date": "January 17, 2017"}, {"text": "I loved the place, the food & the staff!\nOne of my favorite places in town!\nEverything on the menu is worth a try!", "stars": "ui_bubble_rating bubble_50", "date": "January 5, 2017"}, {"text": "The place is nice and simply decorated. The menu offers a wide variety of meals and desserts. The food is really good and the service very efficient. I really recommend this place.", "stars": "ui_bubble_rating bubble_40", "date": "December 11, 2016"}, {"text": "We went to signature more than once. The burgers were really great and so was the chicken with rice and coconut milk. There's a no smoking area which we welcomed since being in Alger that is very rare.", "stars": "ui_bubble_rating bubble_40", "date": "July 3, 2016"}, {"text": "This is a very well located restaurant at Hydra Valley. It is supposed to be trendy ... but it's not. The sophisticated menu doesn’t fit to the expectations. The dishes are not so well prepared, and the deserts although looking great are hardly better. The...", "stars": "ui_bubble_rating bubble_20", "date": "April 21, 2016"}]},
{"name": "Caracoya", "note": "4.0 of 5 bubbles", "reviews": [{"text": "By luck we passed by the place and stepped in. The food (we had Dorade, which was really fresh and agneau) was excellent as well as the wine. The staff was very friendly, helpful and focused on the customer. We can recommend this restaurant even...", "stars": "ui_bubble_rating bubble_50", "date": "May 19, 2023"}, {"text": "I am a discerning client who has eaten in some of the top restaurants in the world. This is my favorite restaurant in Algiers. The food is exceptional with a good collection of wine and spirits on offer. I highly recommend the Fillet au Poivre...", "stars": "ui_bubble_rating bubble_50", "date": "March 8, 2023"}, {"text": "Most of the food I've had in Tunisia is a variation on a theme: outside of the couscous stews, it's grilled meat or fish, served with rice, french fries and various other small things.  It's amazing how with this \"standard\" fare, some places stand out....", "stars": "ui_bubble_rating bubble_50", "date": "June 30, 2022"}, {"text": "Nice place, good food, good service, good clientele, good wine menu\nNo view, the place overall is nice-not fancy but good standards", "stars": "ui_bubble_rating bubble_40", "date": "October 12, 2019"}, {"text": "Popular old fashioned restaurant with an unusually extensive menu and wine list.  We very much enjoyed our dinner here.  I ordered octopus salad followed by grilled lamb cutlets and a generous portion of fresh strawberries, accompanied by a Tlemcen red wine.", "stars": "ui_bubble_rating bubble_40", "date": "March 11, 2019"}, {"text": "This place send u back in time, back to the french times. Entering here you can get a picture of how it was back then while having nice food and drinks ;)", "stars": "ui_bubble_rating bubble_40", "date": "January 4, 2019"}, {"text": "We had a very good time at Caracoya. They have a wide choice of French and Algerian dishes, grilled fish, steaks or lamb. The food was really good, the waiters and manager very welcoming and the service first rate.\nThey serve alcohols. \nIt is a...", "stars": "ui_bubble_rating bubble_40", "date": "November 9, 2018"}, {"text": "We were a group of 8 visiting Algiers for a major sporting event. My host recommended this place to me and assured me that I wouldn't be disappointed. The place sits in a dingy alleyway but once that door opens, you are ushered into a...", "stars": "ui_bubble_rating bubble_40", "date": "August 7, 2018"}, {"text": "Well hidden in a narrow ally which stinks! But once you enter the closed door you are taken decades back with the interior! A nice antique look with menu from sixties! Nice food menu and wine list! The server are very honest and good but...", "stars": "ui_bubble_rating bubble_40", "date": "July 10, 2018"}, {"text": "Caracoya has perhaps seen better days as its interior is a bit dated, but there is \"atmosphere\" and service is very good.  I would recommend the cous cous if that is what you are looking to try.  It also serves alcohol.  I ordered beef with...", "stars": "ui_bubble_rating bubble_30", "date": "June 5, 2018"}, {"text": "Thoroughly enjoyed my evening meal at Caracoya. Staff were wonderful; attentive and very friendly. More American-style service than French (e.g., if I needed to ask for something, not that I often did, someone was there immediately to assist), although I was there promptly when it...", "stars": "ui_bubble_rating bubble_40", "date": "August 14, 2017"}, {"text": "The restaurant is the going oasis for expats and diplomats. In the inner covered patio they meet to share a meal and a drink, and to forget the strict rules outside the doors. \n\nThe staff is very attentive and friendly, the wine is great and...", "stars": "ui_bubble_rating bubble_50", "date": "July 6, 2017"}, {"text": "This is one of those restaurants one most visit once in Algiers. It’s not that it has an exquisite cuisine, or ambiance but it’s really a trip to Algiers past lively life. The first two rooms are a great example of it. Dark washed wooden...", "stars": "ui_bubble_rating bubble_30", "date": "July 25, 2016"}, {"text": "Excellent unexpected discovery. Very popular with locals. Good meats. Alcohol served and attentive service - something you don't always get here.", "stars": "ui_bubble_rating bubble_40", "date": "April 22, 2016"}, {"text": "I am yet to find good service in Algeria. However the staff do there best to cater to guest. Typical international food (very French) restaurant. One of the oldest in Algiers. Off didouche mourad street. Local average wine, however the food is good, tasty, with...", "stars": "ui_bubble_rating bubble_40", "date": "March 26, 2016"}]},
{"name": "Restaurant Le Tyrolien", "note": "4.0 of 5 bubbles", "reviews": [{"text": "This restaurant deserve more than 5 stars I am visiting from the states my father took me there for dinner it was perfect I had a steak and fruit salad I really liked it thanks for the owner who asked us at the end keep...", "stars": "ui_bubble_rating bubble_50", "date": "December 6, 2015"}, {"text": "Always difficult to find \"international\" food yet still very local in Algiers. However this restaurant is totally local at an international level. All kinds of grilled/BBQ'd meats, fresh greens, breads with cheese, humus, etc.  French and Arabic spoken with a little English. Prompt efficient service....", "stars": "ui_bubble_rating bubble_50", "date": "October 27, 2015"}, {"text": "I'm heading to the Tyrolien since 2009, an old Grill bar founded in 1968 and leading by a very professional brothers. At Le Tyrolien you'll find Algerian chilli salade and veggies salade (served by default) and grilled meat (lamb, beef and chicken) one of the...", "stars": "ui_bubble_rating bubble_40", "date": "October 26, 2015"}, {"text": "Good friendly place, good food, price worthy. Everyday of the week they have client, for Thursday and Friday nights you may need to wait for a while for an available place.", "stars": "ui_bubble_rating bubble_40", "date": "July 25, 2015"}, {"text": "one of the best food experience I've had in Algiers. walking along trying to find the place behind the grand post, until you see a small unnoticed door. when you knock someone will open to see a small waiting area, then you go upstairs to...", "stars": "ui_bubble_rating bubble_50", "date": "July 7, 2015"}, {"text": "Small, typical, very good meat, nice staff and clean. \nIt is possible to have beer. It is usual to find a mix between locals and expats.  \nDifficult to park your car.", "stars": "ui_bubble_rating bubble_50", "date": "May 16, 2015"}, {"text": "This place you can't find without local person even its in downtown. Place is very small but service and everything was really great i had great food and  i hope that i ll come back.", "stars": "ui_bubble_rating bubble_50", "date": "February 15, 2015"}, {"text": "It's very very delicious. Thank for your hospitality. \nI am very impressed , and happy to had this opportunity to discover your etablissement.", "stars": "ui_bubble_rating bubble_50", "date": "January 29, 2015"}, {"text": "You want meat, that's the place to be in Algiers, if you are able to find it in the small street behind Grande Poste, hidden behind locked unnoticable doors (you knock), you go upstairs , sit around \"kitchen\", so recommended for 3 people max, otherwise...", "stars": "ui_bubble_rating bubble_50", "date": "October 4, 2014"}, {"text": "New, modern, clean, and always serving up us carnivores to get our fix! Good for parties and business lunches too", "stars": "ui_bubble_rating bubble_40", "date": "August 31, 2014"}, {"text": "Le Tyrolien is a place to go if you like meat. (beef steak, ground beef, lamb, merguez sausage etc..)\n\nIt used to be a restaurant before the Independance in 1962 and the French owner left the key to his Algerian cook. Now It is the...", "stars": "ui_bubble_rating bubble_50", "date": "August 12, 2014"}, {"text": "If you like grilled meat, Le Tyrolien is the place to go. It's a little unpretentious place where the grill takes pride of the place right in the heart of the restaurant. Be prepared to eat delicious lamb, beef, chicken and turkey but also to...", "stars": "ui_bubble_rating bubble_40", "date": "August 5, 2014"}, {"text": "famous meaterie in a lane and can be difficult to spot. My barber is next door, if that helps. No sign outside as such. Get in early as others say and take a seat. Not sure if there is a menu, but the man in...", "stars": "ui_bubble_rating bubble_40", "date": "May 31, 2014"}, {"text": "Restoran realy does not look like a place where you want to eat, but meat is realy delicious! Great recommendation by TripAdvisor!", "stars": "ui_bubble_rating bubble_50", "date": "May 27, 2014"}, {"text": "Algiers is definitely not one of the gastronomical destinations... but there are a few gems in the city. And to be honest... for me... this is the BEST restaurant for meat in town... the BEST BY FAR.\n\nYes, it is small... yes you will leave...", "stars": "ui_bubble_rating bubble_50", "date": "January 31, 2014"}]},
{"name": "Le Normand", "note": "4.0 of 5 bubbles", "reviews": [{"text": "very very good food, service and wine.\nwould love to go again soon\nI loved it", "stars": "ui_bubble_rating bubble_50", "date": "December 20, 2011"}]},
{"name": "Brasserie des Facultes", "note": "3.5 of 5 bubbles", "reviews": [{"text": "I had a number of evening meals at the Brasserie des Facultes during a week's business trip to Algiers. I was never disappointed with the high standard of the food, particularly the European dishes on the varied menu, or the service by very professional and...", "stars": "ui_bubble_rating bubble_40", "date": "July 20, 2013"}, {"text": "We went to the ‘Fac’ a couple of times during a recent visit to Algiers. Toni1013's review immediately below seems entirely accurate: we too thought that it was a perfectly satisfactory place for an evening meal with a glass or two of wine.\n \nThe brasserie...", "stars": "ui_bubble_rating bubble_30", "date": "March 13, 2013"}, {"text": "I've always walked past this place on my way somewhere else, and wondered what it was like. Walking in, the first thing that we saw were some slightly tired looking fish in a counter. A little off putting but I was already in the mood...", "stars": "ui_bubble_rating bubble_30", "date": "September 2, 2012"}, {"text": "nice place to get a feel for central Algiers ,near every major downtown  landmarks ; food is adequate ,more like a steak house european style ;mostly business clientele ;you may have to wait for tables ;place serves alcohol", "stars": "ui_bubble_rating bubble_30", "date": "July 13, 2012"}, {"text": "This was my second visit to Algiers within several months. On both visits, I went to \"Brasserie des Facultes\". With both visits, this was a highlight. Last night we were a group of 5 who were unanimous in our agreement that all that we ordered...", "stars": "ui_bubble_rating bubble_50", "date": "June 25, 2012"}, {"text": "Ths place serves the usual food, mixture of local (like couscous) and european (like lamb chops and french fries). Everything is OK without being exceptional ; the food, the place, the service, the wine... It is quite central and rather cheap.\n\nIf you are staying...", "stars": "ui_bubble_rating bubble_40", "date": "May 11, 2012"}, {"text": "I went here because I have a friend who had raved about it. I don't regret it because the restaurant is in the centre of town, and the food and service are both OK. However, I cannot give it more than 3 out of 5...", "stars": "ui_bubble_rating bubble_30", "date": "April 21, 2012"}, {"text": "A very good address for a quick lunch when downtown, with very friendly service (English-speaking) and good value for money, but does not accept credit cards", "stars": "ui_bubble_rating bubble_40", "date": "January 5, 2012"}]},
{"name": "Chez Rachid, l'Araucaria", "note": "4.5 of 5 bubbles", "reviews": [{"text": "Very civilised place out in the forests to the west of town. Fish a priority, around 2000 per portion. Steaks good quality. Overall bill came to around 5000 a head which included 2 bottles of wine, starters and main courses. Genial owners as well who...", "stars": "ui_bubble_rating bubble_40", "date": "August 14, 2015"}]},
{"name": "El djenina", "note": "3.5 of 5 bubbles", "reviews": [{"text": "Everytime we come to Algiers we do not want to miss a dinner here.\nVery nice location with a view, wonderful traditional decoration. \nAnd what about the food? It is very difficult to chose everything is mouth watering.\nThe owner takes care of her guests...", "stars": "ui_bubble_rating bubble_50", "date": "October 22, 2022"}, {"text": "This is a very nice restaurent for traditional Algerian food, very tasty plates , an old restaurant which is still very class and tasty", "stars": "ui_bubble_rating bubble_40", "date": "September 3, 2019"}, {"text": "The place is nice, with an elegant design. But the compliment stops here. Food is untasty, far from any real Algerian cuisine. It looks like spices are not at the menu. Everything is flat. Even a basic couscous looks like coming from a can. Better...", "stars": "ui_bubble_rating bubble_10", "date": "March 1, 2019"}, {"text": "We liked it so much that we went there two times during our stay in Algiers\nVery nice setting and mouthwatering food definitively worth a visit", "stars": "ui_bubble_rating bubble_50", "date": "November 9, 2018"}, {"text": "We were recommended to eat here and glad we did. Warm welcome from English speaking host. Interesting décor in 2 rooms which enhanced the experience. Good local and international wine selection. The Aboukir white and rose very drinkable.\nInteresting and varied selection on menu: we...", "stars": "ui_bubble_rating bubble_40", "date": "May 17, 2018"}, {"text": "The garden is a nice marocain restaurant with a cosy atmosphere for a relaxed meal. The Tajines are the the most demanded but the mechoui is algo good. Although is not a outstanding restaurant it's worth by the deco and the international atmosphere", "stars": "ui_bubble_rating bubble_30", "date": "April 28, 2018"}, {"text": "Following a good meal, I was surprised to see that they charged 50 cl price for the wine where they delivered only 37,5 cl. The reply I got when I complained was ‘it’s an error on menu and we haven’t had anyone complain’. She acted...", "stars": "ui_bubble_rating bubble_10", "date": "April 8, 2018"}]},
{"name": "Caracoya", "note": "4.0 of 5 bubbles", "reviews": [{"text": "Food good (great bread!) and waiters attentive but not pushy. General style here compares with Jenina but more relaxed and less .... pretentious. And better value for money. The terrace looks like a fun place to eat but often very busy. Shame there's not a...", "stars": "ui_bubble_rating bubble_40", "date": "November 8, 2014"}, {"text": "some friends suggested  me the caracoya for a businness dinner in Alger:the terrace was full, so we have to stay inside. the atmosphere is a little gloomy, and yes indoor smoking is allowed.apparently the speciality is seafood, but I took a sword fish and was...", "stars": "ui_bubble_rating bubble_30", "date": "May 16, 2014"}, {"text": "Very Cozy, nice service, the old fashoned atmosphere adds lots of charm to the place, specially in the outer section, and being located in the city center.. But always parking problems so you have to go there after shops closing.\n Very tasty food and big...", "stars": "ui_bubble_rating bubble_40", "date": "February 11, 2014"}, {"text": "If you are ever looking for a good place to eat in the city center, go for le caracoya! More than a restaurant it's an experience that starts behind a plain door. It's got the feeling of a club but the service of a good...", "stars": "ui_bubble_rating bubble_40", "date": "June 24, 2013"}, {"text": "This place has apparently been in business since 1966, and has hardly changed - in a good way. It looks closed, but a ring on the door bell will see you led in to atmospheric restaurant, with two indoor dining rooms, and a large covered...", "stars": "ui_bubble_rating bubble_40", "date": "November 23, 2012"}]},
{"name": "Le Pavé d'Alger", "note": "5.0 of 5 bubbles", "reviews": [{"text": null, "stars": "ui_bubble_rating bubble_50", "date": "June 17, 2023"}, {"text": null, "stars": "ui_bubble_rating bubble_50", "date": "May 6, 2023"}, {"text": null, "stars": "ui_bubble_rating bubble_50", "date": "May 23, 2022"}, {"text": null, "stars": "ui_bubble_rating bubble_50", "date": "April 4, 2020"}]},
{"name": "Sapori", "note": "5.0 of 5 bubbles", "reviews": [{"text": "An excellent dining experience with friends. Very friendly and helpful staff and great couscous. Price for quality is perfect.", "stars": "ui_bubble_rating bubble_50", "date": "December 15, 2022"}, {"text": "Excellent !\nThe greatest couscous after my mum’s\n\nThe place is lovely and the staff very welcoming \nGreat place to discover the algerian food and culture", "stars": "ui_bubble_rating bubble_50", "date": "August 11, 2022"}]},
{"name": "Jenina", "note": "4.0 of 5 bubbles", "reviews": [{"text": "The place is located in Algiers Center, we actually spent time on the internet looking for a good place to have a local food like Couscous and we ended up choosing Jenina Restaurant, \nThe decor inside is cool but not well maintained, the table was...", "stars": "ui_bubble_rating bubble_20", "date": "October 26, 2016"}, {"text": "The food and ambiance here is awesome. One of the coolest places I experience in Northern Africa. I had squids and grilled prawns. As a dessert some sort of rice pudding that was to die for. I would love to get the recipe.", "stars": "ui_bubble_rating bubble_50", "date": "October 17, 2016"}, {"text": "This is an excellent restaurant tucked away in Algiers. Booking is almost essential. \n\nFood is of a very high quality and service is friendly.  They also serve alcohol which is great!\n\nThe only downsides are that it takes a long time to get a drink...", "stars": "ui_bubble_rating bubble_40", "date": "September 20, 2016"}, {"text": "Good food, great Ambiance, good service. A classy place to experience Algerian food in style. Serves very good wine.", "stars": "ui_bubble_rating bubble_40", "date": "June 27, 2016"}, {"text": "I enjoyed dinner here with several colleagues. I had the meshoui with couscous and a cold Algerian \"Tango\" beer. The service was good, and the atmosphere very authentic. An easy walk down the hill from the St. George Hotel", "stars": "ui_bubble_rating bubble_50", "date": "May 2, 2016"}, {"text": "I had nice dinner with my colleagues from work here. I like very much the design- arabesque decorations, table settings look really nice. I have eaten lamb couscous and both meat and sauce were very tasty. So was the selection of sweets at the end....", "stars": "ui_bubble_rating bubble_40", "date": "April 13, 2016"}, {"text": "Very tasty food, excelent service and above all, gorgeous mauresque decoration. Do try cus cus, it's the best one I've ever had in Algeria.", "stars": "ui_bubble_rating bubble_50", "date": "March 15, 2016"}, {"text": "This restaurant serves alchohol which is not very common. The service is excellent, and the Food is great, but I did not find the presentation was so fantastic. The portions are not very big. It has a very good reputation and it is a safe...", "stars": "ui_bubble_rating bubble_40", "date": "February 8, 2016"}, {"text": "Went to this place for dinner. Great setting in an old palace, few steps away from Bardo Museum. Ordered lamb mechoui. Although the restaurant was half empty, it took some 45mins to get food. But it was worth waiting. The lamb was so tender and...", "stars": "ui_bubble_rating bubble_40", "date": "January 4, 2016"}, {"text": "The food is great. I took a mechoui and really enjoyed it. But what really struck me positively is the attention and warm welcome by the lady managing the restaurant (not sure if she's the owner), and i noticed that she gave the same attention...", "stars": "ui_bubble_rating bubble_50", "date": "November 14, 2015"}, {"text": "The food is very very good and the service is amazing. The charming hostess does an excellent job. Service is extremely professional yet relaxing and not at all stuffy. We had a set menu of Algerian food as we were part of a group touring...", "stars": "ui_bubble_rating bubble_50", "date": "November 4, 2015"}, {"text": "We received a very friendly greeting from the owner of the restaurant when we arrived for lunch. The interior of the place is striking, beautifully tiled and decorated with Algerian artifacts. Freshly baked bread, complimentary olives and spiced carots were immediately brought to the table....", "stars": "ui_bubble_rating bubble_50", "date": "September 15, 2015"}, {"text": "A very nice place to dine in Alger... a tasty menu and a very reasonable price list... lots of delicious plates to taste.. traditional Algerian kitchen", "stars": "ui_bubble_rating bubble_50", "date": "September 8, 2015"}, {"text": "The Algerian food is healthy but not that tasty, especially if you like food with spices, they always say that you cannot get a tasty Algerian food from a restaurant, it has to be homemade. yet, so far this is the best place I've tried...", "stars": "ui_bubble_rating bubble_50", "date": "July 8, 2015"}, {"text": "high quality restaurant for Algerian dishes, typically for business  dinners, professional staff, & quality is always ensured", "stars": "ui_bubble_rating bubble_40", "date": "July 4, 2015"}]},
{"name": "Jenina", "note": "4.0 of 5 bubbles", "reviews": [{"text": "This is a very fine restaurant although it was a little bit hard to find.  The restaurant's full name is \"El DJenina\" starting with a D.  It is a bit pricey for Algerian standards but it is worth for the food.  The only downside for...", "stars": "ui_bubble_rating bubble_40", "date": "June 3, 2015"}, {"text": "You might be lucky to sit next to a world leader or a local ambassador. Better book a table before coming.", "stars": "ui_bubble_rating bubble_40", "date": "April 15, 2015"}, {"text": "Some very tasty dishes on the menu here. Even the little cover-appetisers are a treat. But the prices are too high and some of the male waiters are a bit forward and rather amateurish.", "stars": "ui_bubble_rating bubble_40", "date": "November 8, 2014"}, {"text": "I had a wonderful dinner at Jenina. When you first walk in, you're immediately transported from the busy, noisy street outside to a calm and exclusive setting within the restaurant.\n\nThe food is great, and I really enjoyed my meal here - a definite first-choice...", "stars": "ui_bubble_rating bubble_40", "date": "October 3, 2014"}, {"text": "I recently visited Algiers and was lucky to have been invited to this restaurant.  I subsequently returned one more time. The Décor is definitely Arabic style and wonderfully decorated.  Impeccably clean, the lady owner is a professional, non obtrusive and very attentive to her clients...", "stars": "ui_bubble_rating bubble_50", "date": "June 30, 2014"}, {"text": "I was wowed by the deco, algerian-andalousian style! The soup is just wonderful, the best soup I have ever eaten ! The Chakhchoukha as well was very very delicious ! If you are in Algiers you cannot miss Jenina. In addition, the location is really...", "stars": "ui_bubble_rating bubble_50", "date": "May 5, 2014"}, {"text": "prices are not too bad (say 2000 for a main course) and the soups are good (as per previous reviews) but once you stray into fish territory it gets steep - one John Dory came to 9000 DZD. Wines ok, they have Koutoubia and Blanc...", "stars": "ui_bubble_rating bubble_30", "date": "March 31, 2014"}, {"text": "If you are visiting Algiers, you cannot miss Jenina! The interior is beautiful, in traditional Arabic style, nicely renovated - I had impression to be in the palace of One Thousand and One Nights.\nIt is worth to go to this restaurant at least to...", "stars": "ui_bubble_rating bubble_50", "date": "March 5, 2014"}, {"text": "I know the place very well about a dozen visits over the past 10 years and I can say the place can be spectacular but also just average sometimes. If you are looking for traditional Algerian food in a nice setting, this is the place...", "stars": "ui_bubble_rating bubble_40", "date": "November 25, 2013"}, {"text": "It is quite rare walking into a restaurant that you instantly know you are up for a great meal. Jenina gives you that exact feeling.\nSeveral Algerian friends suggested Jenina for a good hearty traditional Algerian meal and recommended that I book given that its...", "stars": "ui_bubble_rating bubble_50", "date": "May 30, 2013"}, {"text": "Food very algerian,  done well. Wine list was good. Food was yummy. \n Shame about the smoking all around the place. \nService a bit slow and not efficient, but they did try.", "stars": "ui_bubble_rating bubble_40", "date": "April 26, 2013"}, {"text": "Went there 2 years ago, and took some business partners last time, really dissappointed, it seems that the prices got higher, and the quality went down, it is a shame since the first time I loved it, they should make more efforts,", "stars": "ui_bubble_rating bubble_30", "date": "April 10, 2013"}, {"text": "Its a typical business dinner restaurant, very serious staff, owners etc.. not suitable when having a special occasion or valentine's eve ;)", "stars": "ui_bubble_rating bubble_40", "date": "March 17, 2013"}, {"text": "Friendly waiters, elaborated food, totally recomended for a business meal. Price wise is accordance with the status of the restaurant which is as I been informed among the most popular in Algiers, 2 persons with Entre + Soup + Land + wine (algerian) + Dessert,...", "stars": "ui_bubble_rating bubble_40", "date": "February 24, 2013"}, {"text": "I have eaten here ove the past 8 years and never been disappointed.\n\nA true gem !\n\nPeter Wilson\n\nIoW U.K.", "stars": "ui_bubble_rating bubble_50", "date": "January 6, 2013"}]},
{"name": "Taj Mahal", "note": "4.0 of 5 bubbles", "reviews": [{"text": "Food is very nice and authentic Indian \nService is great and friendly \nOne of the nicest restaurants to try in ALGER", "stars": "ui_bubble_rating bubble_50", "date": "March 15, 2019"}, {"text": "We ate at the seafood specialty section of the restaurant located in Cheraga. \n\nWe also do frequent takeouts, so in general we are happy with the products offered except for the desserts.   I would expect different from the kulfi glace.   It was hardly cold, more...", "stars": "ui_bubble_rating bubble_30", "date": "March 15, 2019"}, {"text": "I think it was better. The food always good the price little bit high the service is good i will visit it again", "stars": "ui_bubble_rating bubble_30", "date": "February 25, 2019"}, {"text": "Huge variations of different selection of Indian cuisine that is extremely well prepared and with great care. Taj Mahal restaurants' staff takes high measures in making their dishes and have great management.", "stars": "ui_bubble_rating bubble_50", "date": "January 25, 2019"}, {"text": "I had been to Taj Mahal hotel and found a good selection of Indian food. As mentioned in various review portions are big. Delicious food.", "stars": "ui_bubble_rating bubble_50", "date": "January 18, 2019"}, {"text": "Rich menu with Great taste, very friendly staff but the restaurant is basic in terms of atmosphere , definitely one of the best in town for Indian food", "stars": "ui_bubble_rating bubble_40", "date": "January 15, 2019"}, {"text": "This reetro ktch eighties restaurant is a must in the Algiers restaurant scene. A trip to the past in terms of deco and atmosphere. The indian food is decent and Lamb Korma (always my favorite) is a valid choice. Efficient staff and fast service at...", "stars": "ui_bubble_rating bubble_30", "date": "December 16, 2018"}, {"text": "This restaurant is definitely the best in town for Indian food, great assortments in the menu & wonderful taste. The prices however are 20 to 25% higher than standard in the city , for almost same taste.", "stars": "ui_bubble_rating bubble_40", "date": "November 27, 2018"}, {"text": "very delicious food and nice staff ,clean place\ngood prices, a wide range of meals available all taste good", "stars": "ui_bubble_rating bubble_50", "date": "November 6, 2018"}, {"text": "It is one of my favorite places to me and my family and friends. \nWarm hospitality and tasty food. I recommend for everybody especially foreigners and tourists.", "stars": "ui_bubble_rating bubble_50", "date": "October 11, 2018"}, {"text": "The service is quite fast, the personnel is welcoming\nThere is a warm athmosphere, you feel as if you were having lunch in a train restaurant, \n« The Indian Express »\nThe carte is quite long with a great choice of good and tasty dishes...", "stars": "ui_bubble_rating bubble_50", "date": "October 4, 2018"}, {"text": "Diner or lunch in Algiers? spices and varieties? With family or for Business? \nTaj Mahal will be definitely a superb choise.\n\nThat amazing experience for the last 12 years once a month at least let me know the meaning of standardization in terms of keeping...", "stars": "ui_bubble_rating bubble_50", "date": "October 3, 2018"}, {"text": "One of the best in the world, authentic Indian food, lovely staff, talented cashier, everyone is nice, simply amazing place to visit I recommend.", "stars": "ui_bubble_rating bubble_50", "date": "August 15, 2018"}, {"text": "In walking distance from where I work you find this great restaurant. I have eaten there several times and left the restaurant very happy - and very full:-)\nGenerous portions - Good selection - Good Service!\nAlready looking forward to go back!\nProbably the best...", "stars": "ui_bubble_rating bubble_50", "date": "August 13, 2018"}, {"text": "The facilities were just great with high level restaurant.\nThe Room was divided in different areas with separate bedroom. Free minibar.\nExcellent quality/price balance", "stars": "ui_bubble_rating bubble_50", "date": "May 8, 2018"}]},
{"name": "Taj Mahal", "note": "4.0 of 5 bubbles", "reviews": [{"text": "It is down the lane in cheraga area. Very good indian food . Bit pricey but quality of food is great. Service is great.", "stars": "ui_bubble_rating bubble_50", "date": "March 24, 2018"}, {"text": "À delicacy for the eye and the stomach\nNot very spicy hot\nFriendly service and fast even it was crowded", "stars": "ui_bubble_rating bubble_50", "date": "March 7, 2018"}, {"text": "One of my favorite retaurant in Algiers. Can enjoy exquisite dishes with kind service. To-go serice is available as well.", "stars": "ui_bubble_rating bubble_50", "date": "February 13, 2018"}, {"text": "Good Food and expensive price But the best in the Alger. I am so sorry about my Comment but this is the right", "stars": "ui_bubble_rating bubble_30", "date": "January 24, 2018"}, {"text": "My friend and I had food poisoning after having lunch at this restaurant. I suspect the hygiene of this place to be up to standards.", "stars": "ui_bubble_rating bubble_10", "date": "January 22, 2018"}, {"text": "The restaurant is excellent! It's beautifully decorated and the menu is versatile. Service is friendly and fast and the taste of food excellent! Kids loved aquariums! It's really nice to see this kind of restaurant in Alger!!", "stars": "ui_bubble_rating bubble_50", "date": "January 21, 2018"}, {"text": "This was the third time I visit this place but unfortunately the quality of food was not as good as before. I almost asked for the same good dishes I used to have but could notice that the taste was not as good as it...", "stars": "ui_bubble_rating bubble_30", "date": "January 19, 2018"}, {"text": "Well the chicken Tika Dhonia with Cheese Naan was great i like to say best indian in the location without any Regrets", "stars": "ui_bubble_rating bubble_50", "date": "January 9, 2018"}, {"text": "Tasty and spicy Indian food. Great service. A lot of food. Local atmosphere nearby. Not touristic area.", "stars": "ui_bubble_rating bubble_50", "date": "December 13, 2017"}, {"text": "Amazing and so happy to see this in Algeria. Superb quality of food and very nice service. A very good menu and give you a lot of options. Tried many items and all were very well cooked. 5 Star rating....", "stars": "ui_bubble_rating bubble_50", "date": "November 17, 2017"}, {"text": "Its very good veryyyyyy good i love it. \nI dont eat spicy food but in this place i could eat all what i want and not even feel the spicy tast", "stars": "ui_bubble_rating bubble_50", "date": "November 8, 2017"}, {"text": "one of the best restaurant in ALGIERS, the staff was very friendly with us. Ecxellent service and the foos was tasty aned very delicious.\ncongratulation for the best.", "stars": "ui_bubble_rating bubble_40", "date": "September 6, 2017"}, {"text": "We arrived yesterday and we saw this restaurant , the team was excelent very pleased with us, the food was very good thx to the team and we will come back soon !", "stars": "ui_bubble_rating bubble_50", "date": "August 25, 2017"}, {"text": "One of the best Restaurant in Algiers, excellent service, very tasty food and fresh. A must in Algiers", "stars": "ui_bubble_rating bubble_50", "date": "July 22, 2017"}, {"text": "No question, I agree with the reviews on the quality of the food, and the fine and attentive service. Indian cuisine is probably my favourite and so was delighted with the taste of the dishes we ordered, a variety of veg and poultry and a...", "stars": "ui_bubble_rating bubble_50", "date": "July 21, 2017"}]},
{"name": "Taj Mahal", "note": "4.0 of 5 bubbles", "reviews": [{"text": "The most delicious Indian food ever , the best in Algeria also , very kind staff,  expert cook, if you visit Algiers you must try it.", "stars": "ui_bubble_rating bubble_50", "date": "July 19, 2017"}, {"text": "We went for Lunch to this Indian and spent a very nice moment.\nThe service were nice and very frindly.\nFood was good and nice portions.\nIf you like Indian food, the place to go in Algiers!", "stars": "ui_bubble_rating bubble_40", "date": "May 23, 2017"}, {"text": "Went here tonight, every member of staff I saw spoke with me (I only speak English) to check things were ok. The service was fast and the food was hot and delicious.\nI am staying at the Sofitel and the taxi took about 20mins each...", "stars": "ui_bubble_rating bubble_50", "date": "May 19, 2017"}, {"text": "The place is good and the Indian Food served is also very good specially where you do not get the basic material in the market", "stars": "ui_bubble_rating bubble_40", "date": "May 9, 2017"}, {"text": "I have been visiting this restoration since it's opening , it made me love Indian cuisine with a variety of dishes and good spices. Must visit place if you are in Algeria and try the mix grill dish with rice and chicken sauce.", "stars": "ui_bubble_rating bubble_50", "date": "April 26, 2017"}, {"text": "This is ultimately the best restaurant in Algeria, with its large variety of Indian food, delicious and so special.\nI come at least once a month to it and as if it's a new discovery every time. \nSo fabulous.", "stars": "ui_bubble_rating bubble_50", "date": "April 21, 2017"}, {"text": "I love Indian food, but to charge 900DA for white rice? Overly priced. After seeing my bill for average Indian food, I was turned off, I think I am ok with having Indian food for a while.", "stars": "ui_bubble_rating bubble_30", "date": "March 25, 2017"}, {"text": "Like most Indian restaurants out of India, this restaurant is also unreasonably expensive and thoroughly average in taste.  I do not understand why indian restaurants abroad are so expensive.", "stars": "ui_bubble_rating bubble_20", "date": "February 28, 2017"}, {"text": "It's the best Indian restaurant you can find the center it is not expensive it's like 25 € for 2 people for lunch well depending on how much you eat and what you order . How ever 25€ ~_ 3500 dinar you can have appetizer,...", "stars": "ui_bubble_rating bubble_40", "date": "January 26, 2017"}, {"text": "It was delicious, not the best indian food ever, service is decent, prices are Okay a bit expensive for locals..", "stars": "ui_bubble_rating bubble_50", "date": "January 4, 2017"}, {"text": "In knew this restaurant since 2009.weekly visit.indian best food.proper & clean .comparing to 2009 prices are going up & up.", "stars": "ui_bubble_rating bubble_40", "date": "December 22, 2016"}, {"text": "As business grows travel becomes necessary. The best ever Indian food in an alien land. Nice ambience authentic cooking. Very helpful staff.", "stars": "ui_bubble_rating bubble_50", "date": "December 20, 2016"}, {"text": "I always like this restaurant, I met the owner years ago and his stories about the recipes and the ingredients that he is managing to bring from outside Algeria to maintain his standards still bells in my mind... great taste and friendly stuff. Please try...", "stars": "ui_bubble_rating bubble_50", "date": "November 19, 2016"}, {"text": "One of the best Indian foods i tasted! A must visit restaurant whenever in Algiers if you're a fan of Indian food! The dhal is exquisite", "stars": "ui_bubble_rating bubble_40", "date": "November 19, 2016"}, {"text": "It has an comfortable atmosphere . quick professional  service / I enjoyed with my family / and better thing you got a hot diner food .", "stars": "ui_bubble_rating bubble_40", "date": "November 16, 2016"}]},
{"name": "Taj Mahal", "note": "4.0 of 5 bubbles", "reviews": [{"text": "For Indian cuisine lovers this restaurant offer delicious Indian food in Algiers. The staff are nice and friendly, prices are fair. Must go during your stay in Algiers.", "stars": "ui_bubble_rating bubble_40", "date": "November 13, 2016"}, {"text": "It's not the first time for me to go to this restaurant and taste his good dishes ... every time i feel surprised about the manager, the Indian one with glasses , He is positive , useful, and present if something is  wrong.... I think...", "stars": "ui_bubble_rating bubble_40", "date": "October 6, 2016"}, {"text": "The best indian resturant in algeria , resturant is good has the most delicious indian plates in Algeria.\n\nAlso the indian bread there with meat and cheese is amazing .. \n\nPrice is good conparing the place.", "stars": "ui_bubble_rating bubble_50", "date": "October 6, 2016"}, {"text": "A place I recommend to anyone looking for a calme place to enjoy authentic Indian food with good service and nice decoration nothing to complain about", "stars": "ui_bubble_rating bubble_40", "date": "September 28, 2016"}, {"text": "It's a nice restaurant, a good way to discover some of the indian food and culture. the waiters do their job very well. It's a convenient place to go with family.", "stars": "ui_bubble_rating bubble_40", "date": "September 18, 2016"}, {"text": "Good taste of Indian food\nBoth places are good in location but limited of parking. Service is good and very quick serve. Recommend if like Indian good", "stars": "ui_bubble_rating bubble_40", "date": "September 12, 2016"}, {"text": "A very good hotel for people who love sub continental food. Mixed grill and biryani was excellent. The service was upto the mark.\nWould highly recommend.", "stars": "ui_bubble_rating bubble_40", "date": "September 7, 2016"}, {"text": "Fabulous neat and clean . Better taste than restaraunts in India . HELPFUL STAFF AND HOME AWAY FROM HOME", "stars": "ui_bubble_rating bubble_50", "date": "August 13, 2016"}, {"text": "Excellent Indian food and good service; truly the taste of India delivered to you in Algeria tens of thaousands of miles away from its origin;\nThe sitting is not the best and there is no view but the food quality makes you focus on what...", "stars": "ui_bubble_rating bubble_40", "date": "August 9, 2016"}, {"text": "The food is good though prices increased dramatically these last months.\n\nThe main advantage of this place is the constant quality since it jas opened. \n\nVery friendly and attentive staff.", "stars": "ui_bubble_rating bubble_40", "date": "August 4, 2016"}, {"text": "It was nice restaurant with the same full Indian assortment \nWe enjoy it for two days and I like species food so it's the best", "stars": "ui_bubble_rating bubble_50", "date": "July 18, 2016"}, {"text": "it is a nice place to have a lunch at, the food is good, staff are very friendly, and you can request your food to not be very spicy.\ni have visited it many times, and it is nice for families, groups and for a...", "stars": "ui_bubble_rating bubble_40", "date": "July 16, 2016"}, {"text": "Was a bit sceptical when going to it as I have previously not had good experiences with \"other\" countries' foods whilst in Algeria but this place has restored my faith! The food is delicious and true to Indian culture. I would say it is not...", "stars": "ui_bubble_rating bubble_50", "date": "June 19, 2016"}, {"text": "Very good restaurant and amazing  tasty food  with great menu \nGood and fast service \nIt is real Indian place and very suitable for family and friends", "stars": "ui_bubble_rating bubble_50", "date": "June 15, 2016"}, {"text": "amazing food and great people at the reception and the service is very fast the chairs are very comfy great menu and decent prices.", "stars": "ui_bubble_rating bubble_40", "date": "June 7, 2016"}]},
{"name": "Le Bardo", "note": "4.5 of 5 bubbles", "reviews": [{"text": "Good ambiance and good was also OK.Menu is short of limited and takes a bit of time after you have ordered. I didn't notice it as packed house.", "stars": "ui_bubble_rating bubble_40", "date": "July 16, 2016"}, {"text": "Nice place, with a good ambiance and service. Well presented food, good decor. Modernist and up market appearance.", "stars": "ui_bubble_rating bubble_40", "date": "June 27, 2016"}, {"text": "This is a great place for lunch or dinner. Service and food is fantastic. They should apply for a Michelin Star it's that good. I had fish and it was just mouthwatering. It's not a chain or owned by a massive group. It's unique and...", "stars": "ui_bubble_rating bubble_50", "date": "May 31, 2016"}, {"text": "owned by the Fechkeur family, prominent in local biz circles, and the set up is prime territory for men and women in suits to discuss the economy etc over a steak. Have been a few times but at the time of writing there are issues...", "stars": "ui_bubble_rating bubble_30", "date": "April 9, 2016"}, {"text": "We've been waiting a long time for the re-opening of this historic restaurant in Algiers, a spot you must pass by if you ever happen to stay in Algiers as it was a well known spot for artists and politicians back in the days, it...", "stars": "ui_bubble_rating bubble_50", "date": "December 11, 2015"}]},
{"name": "Restaurant Le Tyrolien", "note": "4.0 of 5 bubbles", "reviews": [{"text": "Make sure you go by 19:30 cause they do run out of the good stuff. Have a drink downstairs then head up to the grill :) Best grills ever and finish it with a grilled Camembert with a fresh baguette it is the best finish...", "stars": "ui_bubble_rating bubble_50", "date": "October 27, 2013"}, {"text": "I had the pleasure of returning to Le Tyrolien last week with three friends, one of whom is an Algiers local who was not aware of the restaurant. The reviews from all of us were unanimous...a special place, terrific food and an atmosphere that people...", "stars": "ui_bubble_rating bubble_40", "date": "June 7, 2013"}, {"text": "If you are looking for a good, genuine and refreshing dinner experience, this is the right place to be. Pretty much everything fits with the message: it is a family business that runs since at least two generations, The quality of the meat is excellent,...", "stars": "ui_bubble_rating bubble_50", "date": "April 20, 2013"}, {"text": "A small horse shoe shaped bar which acts as the counter top and table for your meal. A limited but very tasty menu with Alcohol available. If you are looking for a long, lounging dining experience, this is not the restaurant for you. Le Tyrolien...", "stars": "ui_bubble_rating bubble_40", "date": "February 25, 2013"}, {"text": "Tyrolien is a very simple but very nice restaurant in Algiers. We came there for the meat and we were not disapointed at all, it was delicious. The place is difficult to find as there is no sign on the big white door. \nWaiters (cooks)...", "stars": "ui_bubble_rating bubble_40", "date": "February 4, 2013"}, {"text": "We were a group of five and just happened to stumble on the place. The restaurant is on a short side street and with an entrance that is indistinguishable. When you enter, the initial entrance room is quite small and one's first response may be...", "stars": "ui_bubble_rating bubble_40", "date": "January 11, 2013"}, {"text": "Excellent food, the meat is great, the management is little bit bad to people. The management is looking forward to make it an expatriates place.", "stars": "ui_bubble_rating bubble_40", "date": "November 21, 2012"}, {"text": "Quite tricky to find this place (it's very close to la grande poste), but you won't be disappointed if you love meat. The layout is a kind of u-shaped bar, where the customers sit up on high stools. The cooking goes on in the middle...", "stars": "ui_bubble_rating bubble_50", "date": "September 2, 2012"}]},
]